{
    "What is an advantage of HIPS that is not provided by IDS?" : "HIPS protects critical system resources and monitors operating system processes.",
    "Which statement describes a difference between RADIUS and TACACS+?" : "RADIUS encrypts only the password whereas TACACS+ encrypts all communication.",
    "What are two disadvantages of using an IDS? (Choose two.)" : "The IDS does not stop malicious traffic.; The IDS requires other devices to respond to attacks.",
    "Which statement describes one of the rules that govern interface behavior in the context of implementing a zone-based policy firewall configuration?" : "By default, traffic is allowed to flow among interfaces that are members of the same zone.",
    "Which technique is necessary to ensure a private transfer of data using a VPN?" : "encryption",
    "What is the function of the distribution layer of the three-layer network design model?" : "aggregating access layer connections",
    "What two components of traditional web security appliances are examples of functions integrated into a Cisco Web Security Appliance? (Choose two.)" : "web reporting ; URL filtering",
    "Which AAA component can be established using token cards?" : "authentication",
    "Which statement describes a VPN?" : "VPNs use virtual connections to create a private network through a public network.",
    "Which two devices would commonly be found at the access layer of the hierarchical enterprise LAN design model? (Choose two.)" : "Layer 2 switch ; access point",
    "Which two statements are true about NTP servers in an enterprise network? (Choose two.)" : "NTP servers at stratum 1 are directly connected to an authoritative time source. ; NTP servers ensure an accurate time stamp on logging and debugging information.",
    "In the data gathering process, which type of device will listen for traffic, but only gather traffic statistics?" : "NetFlow collector",
    "Which two protocols are link-state routing protocols? (Choose two.)" : "ISIS ; OSPF",
    "What type of route is created when a network administrator manually configures a route that has an active exit interface?" : "static",
    "Which characteristic describes a wireless client operating in active mode?" : "must know the SSID to connect to an AP",
    "What are two types of addresses found on network end devices? (Choose two.)" : "IP ; MAC",
    "What is a characteristic of the WLAN passive discover mode?" : "The AP periodically sends beacon frames containing the SSID.",
    "What is a characteristic of a routed port that is configured on a Cisco switch?" : "It is assigned an IP address.",
    "What action does an Ethernet switch take when it receives a frame with an unknown Layer 2 source address?" : "It records the source address in the address table of the switch.",
    "Which routing protocol is used to exchange routes between internet service providers?" : "BGP",
    "What is the first step in the CSMA/CA process when a wireless client is attempting to communicate on the wireless network?" : "The client listens for traffic on the channel.",
    "What Wi-Fi management frame is regularly broadcast by APs to announce their presence?" : "beacon",
    "What are the three parts of all Layer 2 frames? (Choose three.)" : "payload ; frame check sequence ; header",
    "What is a function of SNMP?" : "provides a message format for communication between network device managers and agents",
    "Which firewall feature is used to ensure that packets coming into a network are legitimate responses to requests initiated from internal hosts?" : "stateful packet inspection",
    "In which memory location is the routing table of a router maintained?" : "RAM",
    "Lightweight access points forward data between which two devices on the network? (Choose two.)" : "wireless LAN controller ; wireless client",
    "A Cisco router is running IOS 15. What are the two routing table entry types that will be added when a network administrator brings an interface up and assigns an IP address to the interface? (Choose two.)" : "local route interface ; directly connected interface",
    "allows administrators to manage network devices" : "SNMP",
    "a series of commands that control whether a device forwards or drops packets" : "ACL",
    "allows a switch to make duplicate copies of traffic that is sent to a traffic analyzer" : "port monitoring",
    "provides statistics on packets flowing through a Cisco router or multilayer swicth" : "NetFlow",
    "uses signatures to detect patterns in network traffic" : "IPS",
    "enforces an access control policy based on packet content" : "packet filter firewall",
    "filters traffic based on defined rules as well as connection context" : "stateful firewall",
    "filters traffic on Layer 7 information" : "application gateway",
    "What is used on WLANs to avoid packet collisions?" : "CSMA/CA",
    "What information within a data packet does a router use to make forwarding decisions?" : "the destination IP address",
    "What is a characteristic of a hub?" : "regenerates signals received on one port out all other ports",
    "What are two events that can occur in Step 1 (Discovery) of the client and AP association process? (Choose two.)" : "listen for beacon frames to find WLAN SSIDs (passive mode) ; send a probe request to the AP with or without a known SSID (active mode)",
    "What are two events that can occur in Step 2 (Authentication) of the client and AP association process? (Choose two.)" : "agree with AP to share Open authentication ; initiate shared key authentication process",
    "What are three events that can occur in Step 3 (Association) of the client and AP association process? (Choose three.)" : "receive AP’s MAC address (BSSID) ; send client’s MAC address to AP ; receive AP’s association identifier (AID)",
    "Which device must connect to another device to gain access to the network?" : "end devices",
    "Which device connects wireless clients to the network?" : "wireless access point (WAP)",
    "Which device uses MAC addresses to determine the exit port?" : "switch",
    "For which discovery mode will an AP generate the most traffic on a WLAN?" : "passive mode",
    "Which parameter is commonly used to identify a wireless network name when a home wireless AP is being configured?" : "SSID",
    "Which two protocols are considered distance vector routing protocols? (Choose two.)" : "EIGRP ; RIP",
    "What information does an Ethernet switch examine and use to build its address table?" : "source MAC address",
    "Which OSI layer header is rewritten with new addressing information by a router when forwarding between LAN segments?" : "Layer 2",
    "At what layer of the OSI model do routers operate?" : "Layer 3",
    "Which wireless parameter refers to the frequency bands used to transmit data to a wireless access point?" : "channel settings",
    "What is a role of an intermediary device on a network?" : "determines the path and directs data along the way to its final destination",
    "What information does an Ethernet switch examine and use to forward a frame?" : "destination MAC address",
    "Which device can control and manage a large number of corporate APs?" : "WLC",
    "Which two roles are typically performed by a wireless router that is used in a home or small business? (Choose two.)" : "Ethernet switch ; access point",
    "What technology is used to prevent Layer 2 loops?" : "STP",
    "Which sentence correctly describes the SVI inter-VLAN routing method?" : "An SVI is needed for each VLAN.",
    "How are IP addressing designs affected by VLAN implementations?" : "Each VLAN must have a different network number.",
    "Which network design layer provides endpoints and users with a connection to the network?" : "Access layer",
    "Which network design layer provides connectivity between distribution layers for large LAN environments?" : "Core layer",
    "Which network design groups interfaces into zones with similar functions or features?" : "ZPF",
    "Which layer aggregates traffic and provides connectivity to services?" : "Distribution layer",
    "Which type of firewall filters information at Layers 3, 4, 5, and 7 of the OSI reference model?" : "Application gateway",
    "Which type of firewall is a combination of various firewall types?" : "Hybrid",
    "Which type of firewall is part of a router firewall, permitting or denying traffic based on Layer 3 and Layer 4 information?" : "Packet filtering",
    "Which type of firewall is a PC or server with firewall software running on it?" : "Host-based",
    "Which type of firewall filters IP traffic between a pair of bridged interfaces?" : "Transparent",
    "What allows a switch to make duplicate copies of traffic passing through it, and then send it out a port with a network monitor attached?" : "Port Mirroring",
    "What is a series of commands that control whether a device forwards or drops packets based on information found in the packet header?" : "ACL",
    "What provides statistics on packet flows passing through a networking device?" : "NetFlow",
    "What is a private network that is created over a public network?" : "VPN",
    "What sets the date and time on network devices?" : "NTP",
    "What gathers a variety of statistics for devices that are configured to send and log status messages?" : "Syslog",
    "Which option allows administrators to monitor and manage network devices?" : "SNMP",
    "What authenticates users to allow access to specific network resources and records what the user does while connected to the resource?" : "AAA Server",
    "What is the purpose of a personal firewall on a computer?" : "to filter the traffic that is moving in and out of the PC",
    "What is the main difference between the implementation of IDS and IPS devices?" : "An IDS would allow malicious traffic to pass before it is addressed, whereas an IPS stops it immediately.",
    "Which two pieces of information should be included in a logical topology diagram of a network? (Choose two.)" : "interface identifier ; connection type",
    "What is a characteristic of a WAN?" : "It connects multiple networks that are geographically separated.",
    "What network monitoring technology enables a switch to copy and forward traffic sent and received on multiple interfaces out another interface toward a network analysis device?" : "port mirroring",
    "What is a function of a proxy firewall?" : "connects to remote servers on behalf of clients",
    "Which technology is used by Cisco Advanced Malware Protection (AMP) in defending and protecting against known and emerging threats?" : "threat intelligence",
    "How is a source IP address used in a standard ACL?" : "It is the criterion that is used to filter traffic.",
    "Which statement describes the Cisco Cloud Web Security?" : "It is a cloud-based security service to scan traffic for malware and policy enforcement.",
    "Refer to the exhibit. The network “A” contains multiple corporate servers that are accessed by hosts from the Internet for information about the corporation. What term is used to describe the network marked as “A”?" : "DMZ",
    "Which network service allows administrators to monitor and manage network devices?" : "SNMP",
    "Which protocol provides authentication, integrity, and confidentiality services and is a type of VPN?" : "IPsec",
    "What is a feature of the TACACS+ protocol?" : "It encrypts the entire body of the packet for more secure communications.",
    "Which layer of the hierarchical design model is a control boundary between the other layers?" : "distribution",
    "Hackers have gained access to account information and can now login into a system with the same rights as authorized users. What type of attack is this?" : "password-based",
    "In what type of attack can threat actors change the data in packets without the knowledge of the sender or receiver?" : "data modification",
    "Threat actors have positioned themselves between a source and destination to monitor, capture, and control communications without the knowledge of network users. What type of attack is this?" : "MiTM",
    "A threat actor has gained access to encryption keys that will permit them to read confidential information. What type of attack is this?" : "compromised key",
    "In what type of attack does a threat attacker attach to the network and read communications from network users?" : "eavesdropping",
    "A threat actor constructs IP packets that appear to come from a valid source within the corporate network. What type of attack is this?" : "IP address spoofing",
    "What type of attack prevents the normal use of a computer or network by valid users?" : "DoS",
    "What is an example of “hacktivism”?" : "A group of environmentalists launch a denial of service attack against an oil company that is responsible for a large oil spill.",
    "Which statement describes cybersecurity?" : "It is an ongoing effort to protect Internet-connected systems and the data associated with those systems from unauthorized use or harm.",
    "What focus describes a characteristic of an indicator of attack (IOA)?" : "It focuses more on the motivation behind an attack and the means used to compromise vulnerabilities to gain access to assets.",
    "What is the motivation of a white hat attacker?" : "discovering weaknesses of networks and systems to improve the security level of these systems",
    "Which risk management plan involves discontinuing an activity that creates a risk?" : "risk avoidance",
    "Which type of network threat is intended to prevent authorized users from accessing resources?" : "DoS attacks",
    "What security tool allows a threat actor to hack into a wireless network and detect security vulnerabilities?" : "KisMac",
    "Which risk management strategy requires careful evaluation of the costs of loss, the mitigation strategy, and the benefits gained from the operation or activity that is at risk?" : "risk reduction",
    "What characteristic describes script kiddies?" : "inexperienced threat actors running existing scripts, tools, and exploits, to cause harm, but typically not for profit",
    "What characteristic describes a gray hat hacker?" : "individuals who commit cyber crimes but not for personal gain or to cause damage",
    "A company has contracted with a network security firm to help identify the vulnerabilities of the corporate network. The firm sends a team to perform penetration tests to the company network. Why would the team use forensic tools?" : "to detect any evidence of a hack or malware in a computer or network",
    "A company has contracted with a network security firm to help identify the vulnerabilities of the corporate network. The firm sends a team to perform penetration tests to the company network. Why would the team use applications such as Nmap, SuperScan, and Angry IP Scanner?" : "to probe network devices, servers, and hosts for open TCP or UDP ports",
    "Which malware executes arbitrary code and installs copies of itself in the memory of the infected computer? The main purpose of this malware is to automatically replicate from system to system across the network." : "Worm",
    "Which malware is non-self-replicating type of malware? It often contains malicious code that is designed to look like something else, such as a legitimate application or file. It attacks the device from within." : "Trojan Horse",
    "Which malware is used to gather information about a user and then, without the user’s consent, sends the information to another entity?" : "Spyware",
    "Which malware typically displays annoying pop-ups to generate revenue for its author?" : "Adware",
    "Which malware is installed on a compromised system and provides privileged access to the threat actor?" : "Rootkit",
    "Which malware denies access to the infected computer system and demands payment before the restriction is removed?" : "Ransomware",
    "What type of attack is tailgating?" : "social engineering",
    "What type of attack is port scanning?" : "reconnaissance",
    "What is the weakest link in network security?" : "people",
    "Which is an example of social engineering?" : "an unidentified person claiming to be a technician collecting user information from employees",
    "What is a significant characteristic of virus malware?" : "A virus is triggered by an event on the host system.",
    "Which access attack method involves a software program that attempts to discover a system password by the use of an electronic dictionary?" : "brute-force attack",
    "What is the purpose of a reconnaissance attack on a computer network?" : "to gather information about the target network and system",
    "To which category of security attacks does man-in-the-middle belong?" : "access",
    "What is the term used when a malicious party sends a fraudulent email disguised as being from a legitimate, trusted source?" : "phishing",
    "What is the primary goal of a DoS attack?" : "to prevent the target server from being able to handle additional requests",
    "What is the best description of Trojan horse malware?" : "It appears as useful software but hides malicious code.",
    "Which tool is used to provide a list of open ports on network devices?" : "Nmap",
    "When describing malware, what is a difference between a virus and a worm?" : "A virus replicates itself by attaching to another file, whereas a worm can replicate itself independently.",
    "What is the main goal of using different evasion techniques by threat actors?" : "to prevent detection by network and host defenses",
    "What is the purpose of a rootkit?" : "to gain privileged access to a device while concealing itself",
    "In what way are zombies used in security attacks?" : "They are infected machines that carry out a DDoS attack.",
    "What allows analysts to request and receive information about the operation of network devices?" : "SNMP",
    "What application captures frames that are saved in a file that contains the frame information, interface information, packet length, and time stamps?" : "Wireshark",
    "Which tool can be used for network and security monitoring, network planning, and traffic analysis?" : "NetFlow",
    "Which tool is used in enterprise organizations to provide real time reporting and long-term analysis of security events?" : "SIEM",
    "Which utility provides numerous command-line options for capturing packets?" : "Tcpdump",
    "What network monitoring tool can be used to copy packets moving through one port, and send those copies to another port for analysis?" : "SPAN",
    "What is the purpose of the Cisco NetFlow IOS technology?" : "to collect operational data from IP networks",
    "Which network technology uses a passive splitting device that forwards all traffic, including Layer 1 errors, to an analysis device?" : "network tap",
    "Which network monitoring tool can provide a complete audit trail of basic information of all IP flows on a Cisco router and forward the data to a device?" : "NetFlow",
    "What is a monitoring tool used for capturing traffic statistics?" : "NetFlow",
    "Which capability is provided by the aggregation function in SIEM?" : "reducing the volume of event data by consolidating duplicate event records",
    "What is an essential function of SIEM?" : "providing reporting and analysis of security events",
    "Which SIEM function is associated with examining the logs and events of multiple systems to reduce the amount of time of detecting and reacting to security events?" : "correlation",
    "Which network monitoring capability is provided by using SPAN?" : "Traffic exiting and entering a switch is copied to a network monitoring device.",
    "Which network tool uses artificial intelligence to detect incidents and aid in incident analysis and response?" : "SOAR",
    "Which network monitoring tool allows an administrator to capture real-time network traffic and analyze the entire contents of packets?" : "Wireshark",
    "Which technology is an open source SIEM system?" : "ELK",
    "Which attack is being used when threat actors position themselves between a source and destination to transparently monitor, capture, and control the communication?" : "MiTM Attack",
    "Which attack is being used when threat actors gain access to the physical network, and then use an MiTM attack to capture and manipulate a legitimate user’s traffic?" : "Session Hijacking",
    "Which attack is being used when threat actors initiate a simultaneous, coordinated attack from multiple source machines?" : "Amplification and Reflection Attacks",
    "Which attack is being used when threat actors use pings to discover subnets and hosts on a protected network, to generate flood attacks, and to alter host routing tables?" : "ICMP Attack",
    "Which attack being used is when a threat actor creates packets with false source IP address information to either hide the identity of the sender, or to pose as another legitimate user?" : "Address Spoofing Attack",
    "Which attack exploits the three-way handshake?" : "TCP SYN Flood attack",
    "Two hosts have established a TCP connection and are exchanging data. A threat actor sends a TCP segment with the RST bit set to both hosts informing them to immediately stop using the TCP connection. Which attack is this?" : "TCP reset attack",
    "Which attack is being used when the threat actor spoofs the IP address of one host, predicts the next sequence number, and sends an ACK to the other host?" : "TCP session hijacking",
    "A program sends a flood of UDP packets from a spoofed host to a server on the subnet sweeping through all the known UDP ports looking for closed ports. This will cause the server to reply with an ICMP port unreachable message. Which attack is this?" : "UDP flood attack",
    "Users in a company have complained about network performance. After investigation, the IT staff has determined that an attacker has used a specific technique that affects the TCP three-way handshake. What is the name of this type of network attack?" : "SYN flood",
    "Which type of attack involves the unauthorized discovery and mapping of network systems and services?" : "reconnaissance",
    "In which TCP attack is the cybercriminal attempting to overwhelm a target host with half-open TCP connections?" : "SYN flood attack",
    "What kind of ICMP message can be used by threat actors to map an internal IP network?" : "ICMP mask reply",
    "What is involved in an IP address spoofing attack?" : "A legitimate network IP address is hijacked by a rogue node.",
    "How is optional network layer information carried by IPv6 packets?" : "inside an extension header attached to the main IPv6 packet header",
    "An attacker is using a laptop as a rogue access point to capture all network traffic from a targeted user. Which type of attack is this?" : "man in the middle",
    "A disgruntled employee is using some free wireless networking tools to determine information about the enterprise wireless networks. This person is planning on using this information to hack the wireless network. What type of attack is this?" : "reconnaissance",
    "Which term describes a field in the IPv4 packet header used to detect corruption in the IPv4 header?" : "header checksum",
    "Which field in the IPv4 header is used to prevent a packet from traversing a network endlessly?" : "Time-to-Live",
    "Which field in an IPv6 packet is used by the router to determine if a packet has expired and should be dropped?" : "Hop Limit",
    "A threat actor uses a program to launch an attack by sending a flood of UDP packets to a server on the network. The program sweeps through all of the known ports trying to find closed ports. It causes the server to reply with an ICMP port unreachable message and is similar to a DoS attack. Which two programs could be used by the threat actor to launch the attack? (Choose two.)" : "Low Orbit Ion Cannon ; UDP Unicorn",
    "A threat actor wants to interrupt a normal TCP communication between two hosts by sending a spoofed packet to both endpoints. Which TCP option bit would the threat actor set in the spoofed packet?" : "RST",
    "What enables a threat actor to impersonate the default gateway and receive all traffic that is sent to hosts that are not on the local LAN segment?" : "ARP cache poisoning",
    "What should a cybersecurity analyst look for to detect DNS tunneling?" : "longer than average DNS queries",
    "A threat actor accesses a list of user email addresses by sending database commands through an insecure login page. What type of attack is this?" : "SQL injection",
    "In what type of attack are HTTP redirect messages used to send users to malicious websites?" : "HTTP 302 cushioning",
    "Which action best describes a MAC address spoofing attack?" : "altering the MAC address of an attacking host to match that of a legitimate host",
    "What is the result of a DHCP starvation attack?" : "Legitimate clients are unable to lease IP addresses.",
    "In which type of attack is falsified information used to redirect users to malicious Internet sites?" : "DNS cache poisoning",
    "Which type of DNS attack involves the cybercriminal compromising a parent domain and creating multiple subdomains to be used during the attacks?" : "shadowing",
    "Which language is used to query a relational database?" : "SQL",					
    "Which term is used for bulk advertising emails flooded to as many end users as possible?" : "spam",
    "Which protocol would be the target of a cushioning attack?" : "HTTP",
    "Which protocol is attacked when a cybercriminal provides an invalid gateway in order to create a man-in-the-middle attack?" : "DHCP",
    "What is an objective of a DHCP spoofing attack?" : "to provide false DNS server addresses to DHCP clients so that visits to a legitimate web server are directed to a fake server",
    "How do cybercriminals make use of a malicious iFrame?" : "The iFrame allows the browser to load a web page from another source.",
    "What is a characteristic of a DNS amplification and reflection attack?" : "Threat actors use DNS open resolvers to increase the volume of attacks and to hide the true source of an attack.",
    "Which two attacks target web servers through exploiting possible vulnerabilities of input functions used by an application? (Choose two.)" : "SQL injection ; cross-site scripting",
    "How does BYOD change the way in which businesses implement networks?​" : "BYOD provides flexibility in where and how users can access network resources.",
    "Which device is usually the first line of defense in a layered defense-in-depth approach?" : "edge router",
    "With the evolution of borderless networks, which vegetable is now used to describe a defense-in-depth approach?" : "artichoke",
    "Which type of business policy establishes the rules of conduct and the responsibilities of employees and employers?" : "company",
    "An administrator is concerned with restricting which network applications and uses are acceptable to the organization. What security policy component does the administrator use to address these concerns?" : "acceptable use policy",
    "What component of a security policy explicitly defines the type of traffic allowed on a network and what users are allowed and not allowed to do?" : "acceptable use policies",
    "What device would be used as the third line of defense in a defense-in-depth approach?" : "internal router",
    "Refer to the exhibit. The security policy of an organization allows employees to connect to the office intranet from their homes. Which type of security policy is this?" : "remote access",
    "What is a characteristic of a layered defense-in-depth security approach?" : "The failure of one safeguard does not affect the effectiveness of the other safeguards.",
    "Which is a BYOD security best practice?" : "subscribe to a device locator service with remote wipe feature",
    "What do security compliance regulations define?" : "what organizations are responsible for providing and the liability for failure to comply",
    "What device would be used as a second line of defense in a defense-in-depth approach?" : "firewall",
    "Which two areas must an IT security person understand in order to identify vulnerabilities on a network? (Choose two.)" : "hardware used by applications ; important applications used",
    "Which access control model is based on attributes of the object (resource) to be accessed, the subject (user) accessing the resource, and environmental factors regarding how the object is to be accessed, such as time of day?" : "attribute-based control",
    "Which access control model is based on an individual’s roles and responsibilities within the organization?" : "non-discretionary access control",
    "Which access control model applies the strictest access control and is typically used in military or mission critical applications?" : "mandatory access control",
    "Which component of AAA is used to determine which resources a user can access and which operations the user is allowed to perform?" : "authorization",
    "What is the biggest issue with local implementation of AAA?" : "Local implementation does not scale well.",
    "A company is experiencing overwhelming visits to a main web server. The IT department is developing a plan to add a couple more web servers for load balancing and redundancy. Which requirement of information security is addressed by implementing the plan?" : "availability",
    "What is an example of privilege escalation attack?" : "A threat actor performs an access attack and gains the administrator password.",
    "What is the principle of least privilege access control model?" : "Users are granted rights on an as-needed approach.",
    "A server log includes this entry: User student accessed host server ABC using Telnet yesterday for 10 minutes. What type of log entry is this?" : "accounting",
    "Which objective of secure communications is achieved by encrypting data?" : "confidentiality",
    "What are three access control security services? (Choose three.)" : "accounting ; authentication ; authorization",
    "Which access control model allows users to control access to data as an owner of that data?" : "discretionary access control",
    "Which two protocols are used to provide server-based AAA authentication? (Choose two.)" : "TACACS+",
    "What three items are components of the CIA triad? (Choose three.)" : "availability ; integrity ; confidentiality",
    "Which type of access control applies the strictest access control and is commonly used in military or mission critical applications?" : "mandatory access control (MAC)",
    "What is the free service that is offered by the U.S. Department of Homeland Security?" : "AIS",
    "What is a world leading threat intelligence team with a goal to help protect enterprise users, data, and infrastructure from active adversaries?" : "Talos",
    "Which security operations platform integrates and enhances a range of security tools and threat intelligence?" : "FireEye Helix",
    "What are three threat intelligence information sharing specifications?" : "STIX ; TAXII ; CyberOX",
    "Which service is provided by the Cisco Talos Group?" : "collecting information about active, existing, and emerging threats",
    "What does the MITRE Corporation create and maintain?" : "CVE",
    "What is the primary function of (ISC2)?" : "to provide vendor neutral education products and career services",
    "Which threat intelligence sharing open standard specifies, captures, characterizes, and communicates events and properties of network operations?" : "CybOX",
    "What is the Common Vulnerabilities and Exposures (CVE) used by the MITRE Corporation?" : "It is a dictionary of CVE Identifiers for publicly known cybersecurity vulnerabilities.",
    "Which service is offered by the U.S. Department of Homeland Security (DHS) that enables real-time exchange of cyberthreat indicators between the U.S. Federal Government and the private sector?" : "AIS",
    "What is the primary function of SANS?" : "to maintain the Internet Storm Center",
    "Why do several network organizations, professionals, and intelligence agencies use shared open standards for threat intelligence?" : "to enable the exchange of CTI in an automated, consistent, and machine readable format",
    "What is the primary purpose of the Forum of Incident Response and Security Teams (FIRST)?" : "to enable a variety of computer security incident response teams to collaborate, cooperate, and coordinate information sharing, incident prevention, and rapid reaction strategies",
    "What threat intelligence group provides blogs and podcasts to help network security professionals remain effective and up-to-date?" : "Talos",
    "True or False? In asymmetric encryption, encryption and decryption use the same key." : "False",
    "What is an example of a symmetric encryption algorithm?" : "Advanced Encryption Standard (AES)",
    "Data Encryption Standard (DES)" : "Diffie-Hellman (DH)",
    "Which hash function is the most secure?" : "SHA-3",
    "Which statement describes the Software-Optimized Encryption Algorithm (SEAL)?" : "SEAL is a stream cipher.",
    "Which statement is a feature of HMAC?" : "HMAC uses a secret key as input to the hash function, adding authentication to integrity assurance.",
    "Which requirement of secure communications is ensured by the implementation of MD5 or SHA hash generating algorithms?​" : "integrity",
    "Which algorithm can ensure data confidentiality?" : "AES",
    "In which way does the use of HTTPS increase the security monitoring challenges within enterprise networks?" : "HTTPS traffic enables end-to-end encryption.",
    "Which protocol is an IETF standard that defines the PKI digital certificate format?" : "X.509",
    "What are two symmetric encryption algorithms? (Choose two.)" : "AES ; 3DES",
    "What is the purpose of code signing?" : "integrity of source .EXE files",
    "Which statement describes the use of certificate classes in the PKI?" : "A class 5 certificate is more trustworthy than a class 4 certificate.",
    "What role does an RA play in PKI?" : "a subordinate CA",
    "What technology supports asymmetric key encryption used in IPsec VPNs?" : "IKE",
    "What technology allows users to verify the identity of a website and to trust code that is downloaded from the Internet?" : "digital signature",
    "True or False? Endpoints are hosts on the network that can access or be accessed by other hosts on the network." : "True",
    "Which type of antimalware software recognizes various characteristics of known malware files?" : "signature-based",
    "Which type of endpoint protection includes iptables and TCP Wrapper?" : "host-based firewall",
    "What provides filtering of websites and block listing to prevent endpoints from accessing malicious web pages?" : "web security appliance",
    "Which type of endpoint protection permits only authorized and compliant devices to connect to the network?" : "network admission and control",
    "What allows Linux system administrators to configure network access rules that are part of the Linux kernel Netfilter modules?" : "iptables",
    "Which of the following uses a profile-based approach to configuring firewall functionality?" : "Windows firewall",
    "Which of the following is a rule-based control and logging system for Linux?" : "TCP wrappers",
    "Which of the following uses a learned baseline model?" : "Anomaly-based strategy",
    "Which antimalware software approach can recognize various characteristics of known malware files to detect a threat?" : "signature-based",
    "In most host-based security suites, which function provides robust logging of security-related events and sends logs to a central location?" : "telemetry",
    "Which technology might increase the security challenge to the implementation of IoT in an enterprise environment?" : "cloud computing",
    "Which statement describes the term attack surface?" : "It is the total sum of vulnerabilities in a system that is accessible to an attacker.",
    "Which HIDS is an open-source based product?" : "OSSEC",
    "Which device in a LAN infrastructure is susceptible to MAC address-table overflow and spoofing attacks?" : "switch",
    "As described by the SANS Institute, which attack surface includes the use of social engineering?" : "human attack surface",
    "What is a host-based intrusion detection system (HIDS)?" : "It combines the functionalities of antimalware applications with firewall protection.",
    "Which security endpoint setting would be used by a security analyst to determine if a computer has been configured to prevent a particular application from running?" : "block listing",
    "In Windows Firewall, when is the Domain profile applied?" : "when the host is connected to a trusted network such as an internal business network",
    "As described by the SANS Institute, which attack surface includes the exploitation of vulnerabilities in wired and wireless protocols used by IoT devices?" : "network attack surface",
    "Which statement describes agentless antivirus protection?" : "Antivirus scans are performed on hosts from a centralized system.",
    "What refers to the amount of data passing from a given source to a given destination in a given period of time?" : "Total throughput",
    "What is the term for the time between the establishment of a data flow and its termination?" : "Session duration",
    "Which term is a list of TCP or UDP processes that are available to accept data?" : "Ports used",
    "Which term is the logical location of essential systems or data?" : "Critical asset address space",
    "Which CVSS metric captures the level of access that is required for a successful exploit of the vulnerability?" : "Privileges required",
    "Which CVSS metric expresses the number of components, software, hardware, or networks, that are beyond the attacker’s control and that must be present for a vulnerability to be successfully exploited?" : "Attack complexity",
    "Which CVSS metric expresses whether multiple authorities must be involved in an exploit?" : "Scope",
    "Which CVSS metric reflects the proximity of the threat actor to the vulnerable component?" : "Attack vector",
    "Which CVSS metric expresses whether human action is required for the exploit to succeed?" : "User interaction",
    "Which management activity is the most effective way to mitigate software vulnerabilities and is required by some security compliance regulations?" : "Enterprise patch management",
    "Which device management activity addresses the inventory and control of hardware and software configurations?" : "Configuration management",
    "Which device management activity involves the implementation of systems that track the location and configuration of networked devices and software across an enterprise?" : "Asset management",
    "Which device management activity is designed to proactively prevent the exploitation of IT vulnerabilities that exist within an organization?" : "Vulnerability management",
    "Which device management activity has measures that can disable a lost device, encrypt the data on the device, and enhance device access with more robust authentication measures?" : "Mobile device management",
    "During which stage would you develop and implement the appropriate activities to take action regarding a detected cybersecurity event?" : "Respond",
    "During which stage would you develop and implement the appropriate activities to maintain plans for resilience and to restore any capabilities or services that were impaired due to a cybersecurity event?" : "Recover",
    "During which stage would you develop and implement the appropriate activities to identify the occurrence of a cybersecurity event?" : "Detect",
    "During which stage would you develop and implement the appropriate safeguards to ensure delivery of critical infrastructure services?" : "Protect",
    "During which stage would you develop the organizational understanding to manage cybersecurity risk to systems, assets, data, and capabilities?" : "Identify",
    "In profiling a server, what defines what an application is allowed to do or run on a server?" : "service accounts",
    "Which metric class in the CVSS Basic Metric Group identifies the impacts on confidentiality, integrity, and availability?" : "Impact",
    "Which statement describes the threat-vulnerability (T-V) pairing?" : "It is the identification of threats and vulnerabilities and the matching of threats with vulnerabilities.",
    "When establishing a server profile for an organization, which element describes the type of service that an application is allowed to run on the server?" : "service account",
    "What are the steps in the vulnerability management life cycle?" : "discover, prioritize assets, assess, report, remediate, verify",
    "Which security management function is concerned with the inventory and control of hardware and software configurations of systems?" : "configuration management",
    "In addressing an identified risk, which strategy aims to decrease the risk by taking measures to reduce vulnerability?" : "risk reduction",
    "Which step in the Vulnerability Management Life Cycle performs inventory of all assets across the network and identifies host details, including operating system and open services?" : "discover",
    "What are the core functions of the NIST Cybersecurity Framework?" : "identify, protect, detect, respond, recover",
    "Which security management function is concerned with the implementation of systems that track the location and configuration of networked devices and software across an enterprise?" : "asset management",
    "When a network baseline is being established for an organization, which network profile element indicates the time between the establishment of a data flow and its termination?" : "session duration",
    "Which class of metric in the CVSS Base Metric Group defines the features of the exploit such as the vector, complexity, and user interaction required by the exploit?" : "Exploitability",
    "Which of the following can carry malware payloads into the network?" : "IMAP",
    "Which of the following presents challenges to decoding packet captures?" : "HTTPS",
    "Which of the following can be used to exfiltrate data hidden in the query messages?" : "DNS",
    "Time stamps that are provided by which protocol may be corrupted to complicate event correlation?" : "NTP",
    "Which of the following spreads malware-infected files and creates vulnerabilities on a network?" : "P2P",
    "Which of the following can be defeated by packets containing spoofed IP addresses?" : "ACL",
    "Which of the following makes message contents and file attachments unreadable?" : "Encryption",
    "Which of the following hides identity details of users who are browsing the web?" : "TOR",
    "A cyberanalyst is reviewing an entry-point ACL. What three types of ICMP traffic should be allowed to access an internal network from the internet? (Choose three.)" : "destination unreachable ; reply ; squelch",
    "A company decides to purchase a device capable of managing load balancing so that traffic will be distributed between their servers. What could be a potential problem using the new device on the network?" : "The LBM probe messages may appear as suspicious traffic.",
    "What method allows VPN traffic to remain confidential?" : "encryption",
    "To facilitate the troubleshooting process, which inbound ICMP message should be permitted on an outside interface?" : "echo reply",
    "Which type of server would support the SMTP, POP, and IMAP protocols?" : "email",
    "Which network service synchronizes the time across all devices on the network?" : "NTP",
    "What port number would be used if a threat actor was using NTP to direct DDoS attacks?" : "123",
    "Which protocol is used to send e-mail messages between two servers that are in different e-mail domains?" : "SMTP",
    "Which type of server daemon accepts messages sent by network devices to create a collection of log entries?" : "syslog",
    "What type of server can threat actors use DNS to communicate with?" : "CnC",
    "Which statement describes the function provided by the Tor network?" : "It allows users to browse the Internet anonymously.",
    "How can NAT/PAT complicate network security monitoring if NetFlow is being used?" : "It hides internal IP addresses by allowing them to share one or a few outside IP addresses.",
    "Which type of network monitoring data includes detailed protocol and payload information for all traffic on a network segment?" : "full-packet capture",
    "What type of network monitoring data summarizes or analyzes network flow or performance data?" : "statistical data",
    "What type of network monitoring data includes device-specific server and host logs?" : "transaction data",
    "What type of network monitoring data includes files that are attached to emails or that were downloaded from the internet?" : "extracted content",
    "What type of network monitoring data contains details of network flows including the 5-tuples the amount of data transmitted and the duration of data transmission?" : "session data",
    "What type of network monitoring data is generated by IPS or IDS devices when suspicious traffic is detected?" : "alert data",
    "What Windows security level is logged when a remote login was unsuccessfully attempted by an unauthorized user?" : "Failure Audit",
    "What Windows security level is logged when a process that is required has successfully loaded on a workstation?" : "Information",
    "What Windows security level is logged when a disk error has occurred during a backup operation?" : "Error",
    "What Windows security level is logged when disk space is getting low?" : "Warning",
    "What Windows security level is logged when an authorized user logs in remotely to a system?" : "Success Audit",
    "What is used to generate and view full packet captures?" : "tcpdump",
    "What two values are part of all NetFlow flow records? (Choose two.)" : "beginning timestamp ; ending timestamp",
    "What does Application Visibility and Control (AVC) use to discover the applications that are responsible for network traffic?" : "NBAR2",
    "Which two devices will create logs of suspicious content that has been detected in application traffic? (Choose two.)" : "Email security appliance ; Web security appliance",
    "What type of event occurs when malicious activity that can affect the availability, integrity and confidentiality of a host and its data occurs?" : "Intrusion",
    "What kind of event is logged when a host first appears on the network?" : "Host or Endpoint",
    "What type of event is used when NetFlow detects a new host on the network?" : "NetFlow",
    "Which type of events concern sessions between hosts that is discovered by the NextGen Firewall directly?" : "Connection",
    "What type of event occurs when changes are detected to network hosts and applications that are known to the network?" : "Network Discovery",
    "What is a feature of the tcpdump tool?" : "It can display packet captures in real time or write them to a file.",
    "Which Windows tool can be used to review host logs?" : "Event Viewer",
    "Which type of security data can be used to describe or predict network behavior?" : "statistical",
    "Which statement describes the tcpdump tool?" : "It is a command-line packet analyzer.",
    "What are two popular SIEM platforms? (Choose two.)" : "Splunk ; Security Onion with ELK",
    "Which Windows host log event type describes the successful operation of an application, driver, or service?" : "information",
    "Which Windows log records events related to login attempts and operations related to file or object access?" : "security logs",
    "What are two of the 5-tuples? (Choose two.)" : "protocol ; source port",
    "In a Cisco AVC system, in which module is NBAR2 deployed?" : "Application Recognition",
    "A NIDS/NIPS has identified a threat. Which type of security data will be generated and sent to a logging device?" : "alert",
    "Which statement describes an operational characteristic of NetFlow?" : "NetFlow collects basic information about the packet flow, not the flow data itself.",
    "Which type of data is used by Cisco Cognitive Intelligence to find malicious activity that has bypassed security controls, or entered through unmonitored channels, and is operating inside an enterprise network?" : "statistical",
    "Which type of alert would have no incident reported and no incident has occurred?" : "true negative",
    "Which type of alert has happened when an alert is received, but no incident has occurred?" : "false positive",
    "Which type of incident has occurred when nothing is reported, however an exploit has occurred?" : "false negative",
    "Which type of alert is it when an alert is received, and an exploit has been verified?" : "true positive",
    "True or False? A benign event should trigger an alert." : "false",
    "What classification is used for an alert that correctly identifies that an exploit has occurred?" : "true positive",
    "Which tool is included with Security Onion that is used by Snort to automatically download new rules?" : "PulledPork",
    "Which tool included in Security Onion is an interactive dashboard interface to Elasticsearch data?" : "Kibana",
    "Which type of analysis relies on different methods to establish the likelihood that a security event has happened or will happen?" : "probabilistic",
    "Which NIDS tool uses a signature-based approach and native multithreading for alert detection?" : "Suricata",
    "What are three analysis tools that are integrated into Security Onion? (Choose three.)" : "Sguil ; Kibana ; Wireshark",
    "What function is provided by Snort as part of the Security Onion?" : "to generate network intrusion alerts by the use of rules and signatures",
    "Which tool is a Security Onion integrated host-based intrusion detection system?" : "Wazuh",
    "Which alert classification indicates that exploits are not being detected by installed security systems?" : "false negative",
    "When real-time reporting of security events from multiple sources is being received, which function in SIEM provides capturing and processing of data in a common format?" : "normalization",
    "What is the value of file hashes to network security investigations?" : "They can serve as malware signatures.",
    "A network administrator is working with ELK. The amount of network traffic to be collected by packet captures and the number of log file entries and alerts that will be generated by network and security devices can be enormous. What is the default time configured in Kibana to show the log entries?" : "24 hours",
    "In which programming language is Elasticsearch written?" : "Java",
    "For how long does the Payment Card Industry Security Standards Council (PCI DSS) require that an audit trail of user activities related to protected information be retained?" : "12 months",
    "What is the host-based intrusion detection tool that is integrated into Security Onion?" : "OSSEC",
    "Which core open source component of the Elastic-stack is responsible for accessing, visualizing, and investigating data?" : "Kibana",
    "What is the default time set in the securityonion.conf file for Sguil alert data retention?" : "30 days",
    "Which tool would an analyst use to start a workflow investigation?" : "Sguil",
    "Which core open source component of the Elastic-stack is responsible for storing, indexing, and analyzing data?" : "Elasticsearch",
    "Which tool concentrates security events from multiple sources and can interact with other tools such as Wireshark?" : "Sguil",
    "Which technique involves assessment and extraction of relevant information from collected data?" : "examination",
    "Which technique involves drawing conclusions from the data?" : "analysis",
    "Which is technique incudes identification of potential sources of forensic data and acquisition, handling, and storage of that data?" : "collection",
    "Which technique includes preparation and presentation of the information which resulted from the analysis?" : "reporting",
    "Which type of evidence was indisputably in the possession of the accused?" : "direct evidence",
    "Which type of evidence supports an assertation that is developed from best evidence?" : "corroborating evidence",
    "Which type of evidence is circumstantial evidence that, in combination with other facts, establishes a hypothesis?" : "indirect evidence",
    "Which type of evidence is in its original state?" : "best evidence",
    "In which step does the threat actor exploit the vulnerability and gain control of the target?" : "exploitation",
    "In which step is the weapon transmitted to the target through the use of a website, removable USB media, an email attachment, or by other means?" : "delivery",
    "In which step does the threat actor gather intelligence and select targets?" : "reconnaissance",
    "In which step does the threat actor use a communication method such as IRC to issue commands to the software that is installed on the target?" : "command and control",
    "In which step does the threat actor use vulnerabilities of the assets that were discovered and builds them into a tool?" : "weaponization",
    "What part of the Diamond Model represents the threat actor?" : "adversary",
    "What part of the Diamond model represents the network path that is used for an exploit?" : "infrastructure",
    "What part of the Diamond Model represents the target of an exploit?" : "victim",
    "Which meta-feature represents what the threat actor gained from an exploit? It can be characterized as confidentially compromised, integrity compromised, and availability compromised." : "result",
    "What part of the Diamond Model represents the tools or techniques that the threat actor uses to attack a target?" : "capability",
    "Which meta-feature of the Diamond Model indicates the path between the parts of the Diamond Model that is used by an exploit?" : "direction",
    "The definition of computer security incidents and related terms element is in which part of the incident response plan?" : "policy",
    "The strategy and goals element is in which part of the incident response plan?" : "plan",
    "The organizational structure and definition of roles, responsibilities, and levels of authority element is in which part of the incident response plan?" : "policy",
    "The prioritization and severity ratings of incidents element is in which part of the incident response plan?" : "policy",
    "Checklist may be found in which part of the incident response plan?" : "procedure",
    "What term is used for a sign that a threat actor maybe be preparing to attack an asset?" : "precursor",
    "What term is used for the group of people who provide incident response services to an organization?" : "CSIRT",
    "What term is used for a time-bound activity that is restricted to a specific step in which an adversary attacks a network?" : "security event",
    "What is a sign that a network security event may have occurred or is occurring?" : "indicator",
    "What has occurred when there is a violation or threat of violation of security policies?" : "incident",
    "What is the term for a set of policies, plans, and procedures that are designed to address cybersecurity breaches?" : "incident handling capability",
    "To ensure that the chain of custody is maintained, what three items should be logged about evidence that is collected and analyzed after a security incident has occurred? (Choose three.)" : "serial numbers and hostnames of devices used as evidence ; time and date the evidence was collected ; location of all evidence",
    "A threat actor has gained administrative access to a system and achieved the goal of controlling the system for a future DDoS attack by establishing a communication channel with a CnC owned by the threat actor. Which phase in the Cyber Kill Chain model describes the situation?" : "action on objectives",
    "Which meta-feature element in the Diamond Model describes tools and information (such as software, black hat knowledge base, username and password) that the adversary uses for the intrusion event?" : "resources",
    "Which action should be included in a plan element that is part of a computer security incident response capability (CSIRC)?" : "Develop metrics for measuring the incident response capability and its effectiveness.",
    "Which two actions can help identify an attacking host during a security incident? (Choose two.)" : "Validate the IP address of the threat actor to determine if it is viable. ; Use an Internet search engine to gain additional information about the attack.",
    "What is a MITRE ATT&CK framework?" : "a knowledge base of threat actor behavior",
    "According to NIST, which step in the digital forensics process involves identifying potential sources of forensic data, its acquisition, handling, and storage?" : "collection",
    "When dealing with security threats and using the Cyber Kill Chain model, which two approaches can an organization use to help block potential exploitations of a system? (Choose two.)" : "Audit endpoints to forensically determine origin of exploit. ; Conduct employee awareness training and email testing.",
    "Which term is used in the Diamond Model of intrusion to describe a tool that a threat actor uses toward a target system?" : "capability",
    "What is the purpose of the policy element in a computer security incident response capability of an organization, as recommended by NIST?" : "It details how incidents should be handled based on the organizational mission and functions.",
    "According to NIST, which step in the digital forensics process involves extracting relevant information from data?" : "examination",
    "Which statement describes the Cyber Kill Chain?" : "It identifies the steps that adversaries must complete to accomplish their goals.",
    "After containing an incident that infected user workstations with malware, what are three effective remediation procedures that an organization can take for eradication? (Choose three.)" : "Update and patch the operating system and installed software of all hosts. ; Rebuild hosts with installation media if no backups are available. ; Use clean and recent backups to recover hosts.",
    "After a threat actor completes a port scan of the public web server of an organization and identifies a potential vulnerability, what is the next phase for the threat actor in order to prepare and launch an attack as defined in the Cyber Kill Chain?" : "weaponization",
    "Which task describes threat attribution?" : "determining who is responsible for the attack",
    "What is the significant characteristic of worm malware?" : "A worm can execute independently of the host system.",
    "What are the three major components of a worm attack? (Choose three.)" : "a payload ; a propagation mechanism ; an enabling vulnerability",
    "This is a forensic tool that can be used by white hat hackers to find any trace of evidence existing in a particular computer system" : "Helix",
    "This is a debugger tool that can be used by black hats to reverse engineer binary files when writing exploits. It can also be used by white hats when analyzing malware." : "IDA Pro",
    "This is a packet crafting tool that uses specially crafted forged packets to probe and test the robustness of a firewall." : "Socat",
    "This is wireless hacking tool that can be used to hack into a wireless netowrk to detect security vulnerabilities." : "NetStumbler",
    "hacktivist" : "make political statements in order to create an awareness of issue that are important to them",
    "script kiddies" : "NO ANSWER",
    "vulnerability brokers" : "discover exploits and report them to vendors",
    "state-sponsored attackers" : "gather intelligence or commit sabotage on specific goals on behalf of their government",
    "threat actors that publicly protest against organizations or governments by posting articles, videos, leaking sensitive information, and performing distributed denial of service (DDoS) attacks" : "hacktivists",
    "inexperienced threat actors running existing scripts, tools, and exploits, to cause harm, but typically not for profit" : "script kiddies",
    "threat actors who steal government secrets, gather intelligence, and sabotage networks of foreign governments, terrorist groups, and corporations" : "State-sponsored",
    "What scenario describes a vulnerability broker?" : "a threat actor attempting to discover exploits and report them to vendors, sometimes for prizes or rewards",
    "In what type of attack is a cybercriminal attempting to prevent legitimate users from accessing network services?" : "DoS",
    "Which field in the IPv6 header points to optional network layer information that is carried in the IPv6 packet?" : "next header",
    "Which type of attack is carried out by threat actors against a network to determine which IP addresses, protocols, and ports are allowed by ACLs?" : "reconnaissance",
    "What kind of ICMP message can be used by threat actors to create a man-in-the-middle attack?" : "ICMP redirects",
    "What are two purposes of launching a reconnaissance attack on a network? (Choose two.)" : "to scan for accessibility ; to gather information about the network and devices",
    "Which type of network attack involves randomly opening many Telnet requests to a router and results in a valid network administrator not being able to access the device?" : "SYN flooding",
    "What functionality is provided by Cisco SPAN in a switched network?" : "It mirrors traffic that passes through a switch port or VLAN to another port for traffic analysis.",
    "forwards all traffic, including Layer 1 errors, to an analysis device" : "NO ANSWER",
    "used to capture traffic and show what is happening on the network" : "protocol analyzer",
    "monitors traffic and compares it againts configured rules" : "IPS",
    "copies frames recieved on one or more ports to port connected to an analysis device" : "SPAN",
    "Which technology is a proprietary SIEM system?" : "Splunk",
    "What are three functionalities provided by SOAR? (Choose three.)" : "It automates complex incident response procedures and investigations. ; It uses artificial intelligence to detect incidents and aid in incident analysis and response. ; It provides case management tools that allow cybersecurity personnel to research and investigate incidents.",
    "Which devices should be secured to mitigate against MAC address spoofing attacks?" : "Layer 2 devices",
    "A network administrator is checking the system logs and notices unusual connectivity tests to multiple well-known ports on a server. What kind of potential network attack could this indicate?" : "reconnaissance",
    "What is a vulnerability that allows criminals to inject scripts into web pages viewed by users?" : "Cross-site scripting",
    "Which cyber attack involves a coordinated attack from a botnet of zombie computers?" : "DDoS",
    "What technique is a security attack that depletes the pool of IP addresses available for legitimate hosts?" : "DHCP starvation",
    "Which type of Trojan horse security breach uses the computer of the victim as the source device to launch other attacks?" : "proxy",
    "What are two examples of DoS attacks? (Choose two.)" : "buffer overflow ; ping of death",
    "Why would a rootkit be used by a hacker?" : "to gain access to a device without being detected",
    "What causes a buffer overflow?" : "attempting to write more data to a memory location than that location can hold",
    "Which type of security threat would be responsible if a spreadsheet add-on disables the local software firewall?" : "Trojan horse",
    "Which two types of hackers are typically classified as grey hat hackers? (Choose two.)" : "hacktivists ; vulnerability brokers",
    "A white hat hacker is using a security tool called Skipfish to discover the vulnerabilities of a computer system. What type of tool is this?" : "fuzzer",
    "It provides a complete audit trail of basic information about every IP flow forwarded on a device." : " ; It provides 24×7 statistics on packets that flow through a Cisco router or multilayer switch.",
    "Which statement describes the function of the SPAN tool used in a Cisco switch?" : "It copies the traffic from one switch port and sends it to another switch port that is connected to a monitoring device.",
    "What are two evasion methods used by hackers? (Choose two.)" : "resource exhaustion ; encryption",
    "Which attack involves threat actors positioning themselves between a source and destination with the intent of transparently monitoring, capturing, and controlling the communication?" : "man-in-the-middle attack",
    "What is the goal of a white hat hacker?" : "protecting data",
    "Once a cyber threat has been verified, the US Cybersecurity Infrastructure and Security Agency (CISA) automatically shares the cybersecurity information with public and private organizations. What is this automated system called?" : "AIS",
    "A user receives a phone call from a person who claims to represent IT services and then asks that user for confirmation of username and password for auditing purposes. Which security threat does this phone call represent?" : "social engineering",
    "Which two characteristics describe a worm? (Choose two)" : "is self-replicating ; travels to new computers without any intervention or knowledge of the user",
    "An attacker is redirecting traffic to a false default gateway in an attempt to intercept the data traffic of a switched network. What type of attack could achieve this?" : "DHCP spoofing",
    "What would be the target of an SQL injection attack?" : "database",
    "The IT department is reporting that a company web server is receiving an abnormally high number of web page requests from different locations simultaneously. Which type of security attack is occurring?" : "DDoS",
    "Why would an attacker want to spoof a MAC address?" : "so that a switch on the LAN will start forwarding frames to the attacker instead of to the legitimate host",
    "Which two characteristics describe a virus? (Choose two.)" : "Malicious code that can remain dormant before executing an unwanted action. ; Malware that relies on the action of a user or a program to activate.",
    "Which type of security attack would attempt a buffer overflow?" : "DoS",
    "Why is asset management a critical function of a growing organization against security threats?" : "It identifies the ever increasing attack surface to threats.",
    "In a defense-in-depth approach, which three options must be identified to effectively defend a network against attacks? (Choose three.)" : "assets that need protection ; vulnerabilities in the system ; threats to assets",
    "What is the first line of defense when an organization is using a defense-in-depth approach to network security?" : "edge router",
    "What three goals does a BYOD security policy accomplish? (Choose three.)" : "identify which employees can bring their own devices ; identify safeguards to put in place if a device is compromised ; describe the rights to access and activities permitted to security personnel on the device",
    "Which two options are security best practices that help mitigate BYOD risks? (Choose two.)" : "Keep the device OS and software updated. ; Only turn on Wi-Fi when using the wireless network.",
    "What is the purpose of mobile device management (MDM) software?" : "It is used to implement security policies, setting, and software configurations on mobile devices.",
    "What does the incident handling procedures security policy describe?" : "It describes how security incidents are handled.",
    "defines system requirements and objectives, rules, and requirements for users when they attach to or on the network" : "security",
    "protects the rights of workers and the company interests" : "company",
    "identifies salary, pay schedule, benefits, work schedule, vacations, etc." : "employee",
    "This is the specification for an application layer protocol that allows the communication of CTI over HTTPS." : "TAXII",
    "This is a set of specifications for exchanging cyberthreat information between organizations." : "STIX",
    "This is is a set of standardized schemata for specifying, capturing, characterizing, and communicating events and properties of network operations." : "CybOX",
    "What is the primary purpose of the Malware Information Sharing Platform (MISP) ?" : "to enable automated sharing of IOCs between people and machines using the STIX and other exports formats",
    "Which statement describes Trusted Automated Exchange of Indicator Information (TAXII)?" : "It is the specification for an application layer protocol that allows the communication of CTI over HTTPS.",
    "Which organization defines unique CVE Identifiers for publicly known information-security vulnerabilities that make it easier to share data?" : "MITRE",
    "How does FireEye detect and prevent zero-day attacks?" : "by addressing all stages of an attack lifecycle with a signature-less engine utilizing stateful attack analysis",
    "What is the primary function of the Center for Internet Security (CIS)?" : "to offer 24×7 cyberthreat warnings and advisories, vulnerability identification, and mitigation and incident responses",
    "What is CybOX?" : "It is a set of standardized schemata for specifying, capturing, characterizing, and communicating events and properties of network operations.",
    "A web server administrator is configuring access settings to require users to authenticate first before accessing certain web pages. Which requirement of information security is addressed through the configuration?" : "confidentiality",
    "When designing a prototype network for a new server farm, a network designer chooses to use redundant links to connect to the rest of the network. Which business goal will be addressed by this choice?" : "availability",
    "When a security audit is performed at a company, the auditor reports that new users have access to network resources beyond their normal job roles. Additionally, users who move to different positions retain their prior permissions. What kind of violation is occurring" : "least privilege",
    "Which component of the zero trust security model focuses on secure access when an API, a microservice, or a container is accessing a database within an application?" : "workload",
    "What is the purpose of the network security accounting function?" : "to keep track of the actions of a user",
    "Which term describes the ability of a web server to keep a log of the users who access the server, as well as the length of time they use it?" : "accounting",
    "Authorized users must have uninterrupted access to important resources and data." : "availability",
    "Data is protected from unauthorized alteration." : "Integrity",
    "Only authorized individuals, entities, or processes can access sensitive information." : "confidentiality",
    "What are two characteristics of the RADIUS protocol? (Choose two.)" : "encryption of the password only ; the use of UDP ports for authentication and accounting",
    "What is a characteristic of the security artichoke, defense-in-depth approach?" : "Threat actors no longer have to peel away each layer before reaching the target data or system.",
    "What is the benefit of a defense-in-depth approach?" : "The effectiveness of other security measures is not impacted when a security mechanism fails.",
    "assets" : "information or equipment valuable enough to an organization to warrant protection",
    "threats" : "potential dangerous to a asset",
    "vulnerabilities" : "weaknesses in a system",
    "What is the principle behind the nondiscretionary access control model?" : "It allows access decisions to be based on roles and responsibilities of a user within the organization.",
    "Passwords, passphrases, and PINs are examples of which security term?" : "authentication",
    "How does AIS address a newly discovered threat?" : "by enabling real-time exchange of cyberthreat indicators with U.S. Federal Government and the private sector",
    "Which type of attack does the use of HMACs protect against?" : "man-in-the-middle",
    "Which two statements correctly describe certificate classes used in the PKI? (Choose two.)" : "A class 4 certificate is for online business transactions between companies. ; A class 0 certificate is for testing purposes.",
    "A customer purchases an item from an e-commerce site. The e-commerce site must maintain proof that the data exchange took place between the site and the customer. Which feature of digital signatures is required?" : "nonrepudiation of the transaction",
    "What is the purpose of a digital certificate?" : "It authenticates a website and establishes a secure connection to exchange confidential data.",
    "In a hierarchical CA topology, where can a subordinate CA obtain a certificate for itself?" : "from the root CA or another subordinate CA at a higher level",
    "What is the purpose for using digital signatures for code signing?" : "to verify the integrity of executable files downloaded from a vendor website",
    "What technology has a function of using trusted third-party protocols to issue credentials that are accepted as an authoritative identity?" : "PKI certificates",
    "In addressing a risk that has low potential impact and relatively high cost of mitigation or reduction, which strategy will accept the risk and its consequences?" : "risk retention",
    "Which two classes of metrics are included in the CVSS Base Metric Group? (Choose two.)" : "Exploitability ; Impact metrics",
    "develop and implement the appropriate activities to identify the occurrence of a cybersecurity event" : "detect",
    "develop and implement the appropriate safeguards to ensure delivery of critical infrastructure services" : "protect",
    "develop an organizational understanding to manage cybersecurity risk to systems, assets, data, and capabilities" : "identify",
    "A cybersecurity analyst is performing a CVSS assessment on an attack where a web link was sent to several employees. Once clicked, an internal attack was launched. Which CVSS Base Metric Group Exploitability metric is used to document that the user had to click on the link in order for the attack to occur?" : "user interaction",
    "In network security assessments, which type of test employs software to scan internal networks and Internet facing servers for various types of vulnerabilities?" : "vulnerability assessment",
    "What are the three outcomes of the NIST Cybersecurity Framework identify core function? (Choose three.)" : "governance ; risk assessment ; asset management",
    "When a server profile for an organization is being established, which element describes the TCP and UDP daemons and ports that are allowed to be open on the server?" : "listening ports",
    "What is an action that should be taken in the discovery step of the vulnerability management life cycle?" : "developing a network baseline",
    "In what order are the steps in the vulnerability management life cycle conducted?" : "discover, prioritize assets, assess, report, remediate, verify",
    "What does the telemetry function provide in host-based security software?" : "It enables host-based security programs to have comprehensive logging functions.",
    "A security professional is making recommendations to a company for enhancing endpoint security. Which security endpoint technology would be recommended as an agent-based system to protect hosts against malware?" : "HIDS",
    "What is a feature of distributed firewalls?" : "They combine the feature of host-based firewalls with centralized management.",
    "An administrator suspects polymorphic malware has successfully entered the network past the HIDS system perimeter. The polymorphic malware is, however, successfully identified and isolated. What must the administrator do to create signatures to prevent the file from entering the network again?" : "Execute the polymorphic file in the Cisco Threat Grid Glovebox.",
    "On a Windows host, which tool can be used to create and maintain blacklists and whitelists?" : "Group Policy Editor",
    "What is blacklisting?" : "This is an application list that can dictate which user applications are not permitted to run on a computer.",
    "Which technique could be used by security personnel to analyze a suspicious file in a safe environment?" : "sandboxing",
    "Which statement describes the term iptables?" : "It is a rule-based firewall application in Linux.",
    "What is the difference between an HIDS and a firewall?" : "An HIDS monitors operating systems on host computers and processes file system activity. Firewalls allow or deny traffic between the computer and other systems.",
    "Which statement describes the Cisco Threat Grid Glovebox?" : "It is a sandbox product for analyzing malware behaviors.",
    "Which statement describes the policy-based intrusion detection approach?" : "It compares the operations of a host against well-defined security rules.",
    "What is the purpose of the DH algorithm?" : "to generate a shared secret between two hosts that have not communicated before",
    "What is a difference between symmetric and asymmetric encryption algorithms?" : "Symmetric encryption algorithms use pre-shared keys. Asymmetric encryption algorithms use different keys to encrypt and decrypt data.",
    "A company implements a security policy that ensures that a file sent from the headquarters office to the branch office can only be opened with a predetermined code. This code is changed every day. Which two algorithms can be used to achieve this task? (Choose two.)" : "3DES ; AES",
    "Which security management plan specifies a component that involves tracking the location and configuration of networked devices and software across an enterprise?" : "asset management",
    "In addressing an identified risk, which strategy aims to stop performing the activities that create risk?" : "risk avoidance",
    "A company is developing a security policy for secure communication. In the exchange of critical messages between a headquarters office and a branch office, a hash value should only be recalculated with a predetermined code, thus ensuring the validity of data source. Which aspect of secure communications is addressed?" : "origin authentication",
    "a list of TCP or UDP processes that are available to accept data" : "ports used",
    "the IP addresses or the logical location of essensial systems or data" : "critical asset address space",
    "the time between the establishment of a data flow and termination" : "session duration",
    "the amount of data passing from a given source to a given destination in a given period of time" : " :total throughput",
    "Which three security services are provided by digital signatures? (Choose three.)" : "guarantees data has not changed in transit ; provides data encryption ; authenticates the source",
    "Which ICMP message type should be stopped inbound?" : "echo",
    "How can IMAP be a security threat to a company?" : "An email can be used to bring malware to a host.",
    "Which two technologies are primarily used on peer-to-peer networks? (Choose two.)" : "Bitcoin ; BitTorrent",
    "Which protocol is exploited by cybercriminals who create malicious iFrames?" : "HTTP",
    "Which method is used by some malware to transfer files from infected hosts to a threat actor host?" : "ICMP tunneling",
    "Why does HTTPS technology add complexity to network security monitoring?" : "HTTPS conceals data traffic through end-to-end encryption.",
    "Which approach is intended to prevent exploits that target syslog?" : "Use syslog-ng.",
    "Which two application layer protocols manage the exchange of messages between a client with a web browser and a remote web server? (Choose two.)" : "HTTP ; HTTPS",
    "What is Tor?" : "a software platform and network of P2P hosts that function as Internet routers",
    "Which protocol is a name resolution protocol often used by malware to communicate with command-and-control (CnC) servers?" : "DNS",
    "Which technology would be used to create the server logs generated by network devices and reviewed by an entry level network person who works the night shift at a data center?" : "syslog",
    "Which function is provided by the Sguil application?" : "It makes Snort-generated alerts readable and searchable.",
    "Which statement describes a Cisco Web Security Appliance (WSA)?" : "It functions as a web proxy.",
    "Which statement describes session data in security logs?" : "It is a record of a conversation between network hosts.",
    "Which two options are network security monitoring approaches that use advanced analytic techniques to analyze network telemetry data? (Choose two.)" : "NBAD ; NBA",
    "How does a web proxy device provide data loss prevention (DLP) for an enterprise?" : "by scanning and logging outgoing traffic",
    "Which information can be provided by the Cisco NetFlow utility?" : "peak usage times and traffic routing",
    "Which statement describes statistical data in network security monitoring processes?" : "It is created through an analysis of other forms of network data.",
    "links logs and events from disparate systems or applications, speeding detection of and reaction to security threats" : "correlation",
    "reduces the volume of event data by consolidating duplicate event records" : "aggregation",
    "maps log messages from different systems into a common data model" : "normalization",
    "Which two tools have a GUI interface and can be used to view and analyze full packet captures? (Choose two.)" : "Wireshark ; Cisco Prime Network Analysis Module",
    "Which Windows log contains information about installations of software, including Windows updates?" : "setup logs",
    "events logged by various applications" : "application logs",
    "events related to the operation of drivers, processes, and hardware" : "system logs",
    "information about the installation of software, including Windows updates" : "setup logs",
    "events related to logon attempts and operations related to file or object management and access" : "security logs",
    "Which Cisco appliance can be used to filter network traffic contents to report and deny traffic based on the web server reputation?" : "WSA",
    "Which technique would a threat actor use to disguise traces of an ongoing exploit?" : "Corrupt time information by attacking the NTP infrastructure.",
    "A system administrator runs a file scan utility on a Windows PC and notices a file lsass.exe in the Program Files directory. What should the administrator do?" : "Delete the file because it is probably malware.",
    "Refer to the exhibit. A network administrator is viewing some output on the Netflow collector. What can be determined from the output of the traffic flow shown?" : "This is a UDP DNS response to a client machine.",
    "In a Cisco AVC system, in which module is NetFlow deployed?" : "Metrics Collection",
    "What does it indicate if the timestamp in the HEADER section of a syslog message is preceded by a period or asterisk symbol?" : "There is a problem associated with NTP.",
    "network path used to establish and maintain command and control" : "infrastructure",
    "a tool or technique used to attack the victim" : "capability",
    "the parties responsible for the intrusion" : "adversary",
    "the target of the attack" : "victim",
    "What two shared sources of information are included within the MITRE ATT&CK framework? (Choose two.)" : "attacker tactics, techniques, and procedures ; mapping the steps in an attack to a matrix of generalized tactics",
    "What information is gathered by the CSIRT when determining the scope of a security incident?" : "the networks, systems, and applications affected by an incident",
    "According to NIST standards, which incident response stakeholder is responsible for coordinating an incident response with other stakeholders to minimize the damage of an incident?" : "management",
    "According to NIST, which step in the digital forensics process involves drawing conclusions from data?" : "analysis",
    "A cybersecurity analyst has been called to a crime scene that contains several technology items including a computer. Which technique will be used so that the information found on the computer can be used in court?" : "unaltered disk image",
    "In which phase of the NIST incident response life cycle is evidence gathered that can assist subsequent investigations by authorities?" : "containment, eradication, and recovery",
    "When dealing with security threats and using the Cyber Kill Chain model, which two approaches can an organization use to block a potential back door creation? (Choose two.)" : "Audit endpoints to discover abnormal file creations. ; Use HIPS to alert or place a block on common installation paths.",
    "What is defined in the SOP of a computer security incident response capability (CSIRC)?" : "the procedures that are followed during an incident response",
    "How does an application program interact with the operating system?" : "making API calls",
    "Which tool included in the Security Onion provides a visual interface to NSM data?" : "Squert",
    "Which tool included in the Security Onion includes the capability of designing custom dashboards?" : "Kibana",
    "How is the hash value of files useful in network security investigations?" : "It helps identify malware signatures.",
    "Which technology is a major standard consisting of a pattern of symbols that describe data to be matched in a query?" : "POSIX",
    "Which term is used to describe the process of converting log entries into a common format?" : "normalization",
    "What is the purpose for data normalization?" : "to simplify searching for correlated events",
    "Which personnel in a SOC is assigned the task of verifying whether an alert triggered by monitoring software represents a true security incident?" : "Tier 1 personnel",
    "Refer to the exhibit. A security analyst is reviewing an alert message generated by Snort. What does the number 2100498 in the message indicate?" : "the Snort rule that is triggered",
    "What are security event logs commonly based on when sourced by traditional firewalls?" : "5-tuples",
    "A threat actor has successfully breached the network firewall without being detected by the IDS system. What condition describes the lack of alert?" : "false negative",
    "What information is contained in the options section of a Snort rule?" : "text describing the event",
    "A network administrator is trying to download a valid file from an internal server. However, the process triggers an alert on a NMS tool. What condition describes this alert?" : "false positive",
    "What is indicated by a Snort signature ID that is below 3464?" : "The SID was created by Sourcefire and distributed under a GPL agreement.",
    "After a security monitoring tool identifies a malware attachment entering the network, what is the benefit of performing a retrospective analysis?" : "A retrospective analysis can help in tracking the behavior of the malware from the identification point forward.",
    "A threat actor collects information from web servers of an organization and searches for employee contact information. The information collected is further used to search personal information on the Internet. To which attack phase do these activities belong according to the Cyber Kill Chain model?" : "reconnaissance",
    "Which HIDS is integrated into the Security Onion and uses rules to detect changes in host-based operating parameters caused by malware through system calls?" : "OSSEC",
    "Which type of events should be assigned to categories in Sguil?" : "true positive",
    "A cybersecurity analyst is going to verify security alerts using the Security Onion. Which tool should the analyst visit first?" : "Sguil",
    "Refer to the exhibit. Which field in the Sguil application window indicates the priority of an event or set of correlated events?" : "ST",
    "older rules created by Sourcefire" : "GPL",
    "rules created and maintained by Cisco Talos" : "VRT",
    "open source rules under BSD license" : "ET",
    "What is the purpose for data reduction as it relates to NSM?" : "to diminish the quantity of NSM data to be handled",
    "Why would threat actors prefer to use a zero-day attack in the Cyber Kill Chain weaponization phase?" : "to avoid detection by the target",
    "What is the objective the threat actor in establishing a two-way communication channel between the target system and a CnC infrastructure?" : "to allow the threat actor to issue commands to the software that is installed on the target",
    "Which meta-feature element in the Diamond Model describes information gained by the adversary?" : "results",
    "In which step of the NIST incident response process does the CSIRT perform an analysis to determine which networks, systems, or applications are affected; who or what originated the incident; and how the incident is occurring?" : "scoping",
    "Which classification indicates that an alert is verified as an actual security incident?" : "true positive",
    "Which algorithm provides asymmetric encryption?" : "Diffie-Hellman (DH)",
    "A user is curious about how someone might know a computer has been infected with malware. What are two common malware behaviors? (Choose two.)" : "The computer gets increasingly slower to respond. ; The computer freezes and requires reboots.",
    "Which two types of attacks are examples of reconnaissance attacks? (Choose two.)" : "port scan ; ping sweep",
    "An administrator discovers a vulnerability in the network. On analysis of the vulnerability the administrator decides the cost of managing the risk outweighs the cost of the risk itself. The risk is accepted, and no action is taken. What risk management strategy has been adopted?" : "risk acceptance",  
    "Which two functions are provided by NetFlow?" : "It provides a complete audit trail of basic information about every IP flow forwarded on a device. ; It provides 24×7 statistics on packets that flow through a Cisco router or multilayer switch.",
    "How can a DNS tunneling attack be mitigated?" : "by using a filter that inspects DNS traffic",
    "What is the function of a gratuitous ARP sent by a networked device when it boots up?" : "to advise connected devices of its MAC address",
    "What is the result of a passive ARP poisoning attack?" : "Confidential information is stolen.",
    "What are two methods used by cybercriminals to mask DNS attacks? (Choose two.)" : "domain generation algorithms ; fast flux",
    "Which two functions are provided by NetFlow? (Choose two.)" : "It provides a complete audit trail of basic information about every IP flow forwarded on a device. ; It provides 24×7 statistics on packets that flow through a Cisco router or multilayer switch.",
    "When a security audit is performed at a company, the auditor reports that new users have access to network resources beyond their normal job roles. Additionally, users who move to different positions retain their prior permissions. What kind of violation is occurring?" : "least privilege",
    "An attacker sends a piece of malware as an email attachment to employees in a company. What is one probable purpose of the attack?" : "searching and obtaining trade secrets",
    "What is cyberwarfare?" : "It is an attack designed to disrupt, corrupt, or exploit national interests.",
    "What type of malware has the primary objective of spreading across the network?" : "worm",
    "What is a potential risk when using a free and open wireless hotspot in a public location?" : "Network traffic might be hijacked and information stolen.",
    "At the request of investors, a company is proceeding with cyber attribution with a particular attack that was conducted from an external source. Which security term is used to describe the person or device responsible for the attack?" : "threat actor",
    "What name is given to an amateur hacker?" : "script kiddie",
    "What commonly motivates cybercriminals to attack networks as compared to hacktivists or state-sponsored hackers?" : "financial gain",
    "What is a botnet?" : "a network of infected computers that are controlled as a group",
    "What is a rogue wireless hotspot?" : "It is a hotspot that appears to be from a legitimate business but was actually set up by someone without the permission from the business.",
    "What is the best definition of personally identifiable information (PII)?" : "Data that is collected by businesses to distinguish identities of individuals.",
    "What was used as a cyberwarfare weapon to attack a uranium enrichment facility in Iran?" : "Stuxnet",
    "A company pays a significant sum of money to hackers in order to regain control of an email and data server. Which type of security attack was used by the hackers?" : "ransomware",
    "Which SOC job role manages all the resources of the SOC and serves as a point of contact for the larger organization or customer?" : "SOC Manager",
    "Which SOC job role processes security alerts and forwards tickets to Tier 2 if necessary?" : "Cybersecurity Analyst",
    "Which SOC job role is responsible for deep investigation of incidents?" : "Incident Responder",
    "Which device integrates security information and event management into a single platform?" : "SIEM",
    "Which device integrates orchestration tools and resources to automatically respond to security events?" : "SOAR",
    "After a security incident is verified in a SOC, an incident responder reviews the incident but cannot identify the source of the incident and form an effective mitigation procedure. To whom should the incident ticket be escalated?" : "a SME for further investigation",
    "Which two services are provided by security operations centers? (Choose two.)" : "monitoring network security threats ; managing comprehensive threat solutions",
    "Which metric is used in SOCs to evaluate the average time that it takes to identify that valid security incidents have occurred in the network?" : "MTTD",
    "Which KPI metric does SOAR use to measure the length of time that threat actors have access to a network before they are detected and the access of the threat actors stopped?" : "Dwell Time",
    "What is the role of SIEM?" : "to analyze all the data that firewalls, network appliances, intrusion detection systems, and other devices generate and institute preventive measures",
    "What is a characteristic of the SOAR security platform?" : "to include predefined playbooks that enable automatic response to specific threats",
    "A network security professional has applied for a Tier 2 position in a SOC. What is a typical job function that would be assigned to a new employee?" : "further investigating security incidents",
    "If a SOC has a goal of 99.99% uptime, how many minutes of downtime a year would be considered within its goal?" : "52.56",
    "Which organization offers the vendor-neutral CySA+ certification?" : "CompTIA",
    "In the operation of a SOC, which system is frequently used to let an analyst select alerts from a pool to investigate?" : "ticketing system",
    "How can a security information and event management system in a SOC be used to help personnel fight against security threats?" : "by collecting and filtering data",
    "Which three technologies should be included in a security information and event management system in a SOC? (Choose three.)" : "vulnerability tracking ; security monitoring ; threat intelligence",
    "Which Windows registry hive stores information about object linking and embedding (OLE) registrations?" : "HKEY_CLASSES_ROOT (HKCR)",
    "Which Windows registry hive stores information about the current hardware profile?" : "HKEY_CURRENT_CONFIG (HKCC)",
    "Which Windows registry hive stores information concerning all the user accounts on the host?" : "HKEY_USERS (HKU)",
    "Which Windows registry hive stores information concerning the currently logged in user?" : "HKEY_CURRENT_USER (HKCU)",
    "Which Windows registry hive stores system-related information?" : "HKEY_LOCAL_MACHINE (HKLM)",
    "Which Windows tool selectively denies traffic to a computer or network segment?" : "Windows Defender Firewall",
    "Which Windows tool logs history, application, security, and system events?" : "Event Viewer",
    "Which windows tool or command can be used to look for inbound or outbound TCP connections on a Windows host that are not authorized?" : "netstat",
    "Which Windows tool provides resource information, such as memory, CPU, disk, and network?" : "Resource Monitor",
    "Which Windows tool is the built-in virus and spyware protection?" : "Windows Defender",
    "Which command or tool finds the IP address of a server from a URL?" : "Nslookup",
    "Which Windows tool provides information about applications, processes, and services running on the computer?" : "Task manager",
    "Which Windows tool is the database that stores all the information about hardware, applications, users, and system settings?" : "Windows Registry",
    "When a user makes changes to the settings of a Windows system, where are these changes stored?" : "Registry",
    "Which user account should be used only to perform system management and not as the account for regular use?" : "administrator",
    "Which command is used to manually query a DNS server to resolve a specific host name?" : "nslookup",
    "For security reasons a network administrator needs to ensure that local computers cannot ping each other. Which settings can accomplish this task?" : "firewall settings",
    "What contains information on how hard drive partitions are organized?" : "MBR",
    "What utility is used to show the system resources consumed by each user?" : "Task Manager",
    "What term is used to describe a logical drive that can be formatted to store data?" : "partition",
    "How much RAM is addressable by a 32-bit version of Windows?" : "4 GB",
    "Which Windows version was the first to introduce a 64-bit Windows operating system?" : "Windows XP",
    "Which net command is used on a Windows PC to establish a connection to a shared directory on a remote server?" : "net use",
    "What is the purpose of the cd command?" : "changes directory to the root directory",
    "What would be displayed if the netstat -abno command was entered on a Windows PC?" : "all active TCP and UDP connections, their current state, and their associated process ID (PID)",
    "A security incident has been filed and an employee believes that someone has been on the computer since the employee left last night. The employee states that the computer was turned off before the employee left for the evening. The computer is running slowly and applications are acting strangely. Which Microsoft Windows tool would be used by the security analyst to determine if and when someone logged on to the computer after working hours?" : "Event Viewer",
    "Which type of tool is used by a Linux administrator to attack a computer or network to find vulnerabilities?" : "PenTesting",
    "What is a benefit of Linux being an open source operating system?" : "Linux distribution source code can be modified and then recompiled.",
    "Which method can be used to harden a device?" : "Force periodic password changes.",
    "A system administrator issues the command ps on a server that is running the Linux operating system. What is the purpose of this command?" : "to list the processes currently running in the system",
    "Which operating system source code can be downloaded and modified by any person or company?" : "Linux",
    "Which file system is the primary file system used by Apple in current Macintosh computers?" : "APFS",
    "Consider the result of the ls -l command in the Linux output below. What are the group file permissions assigned to the analyst.txt file?" : "read, write",
    "In the context of a Linux operating system, which command can be used to display the syntax and parameters for a specific command?" : "man",
    "What is a daemon?" : "a background process that runs without the need for user interaction",
    "Which Linux command can be used to display the name of the current working directory?" : "pwd",
    "An author is uploading one chapter document from a personal computer to a file server of a book publisher. What role is the personal computer assuming in this network model?" : "client",
    "A technician has captured packets on a network that has been running slowly when accessing the internet. Which port number should the technician look for within the captured material to locate HTTP packets?" : "80",
    "A system administrator issues the apt-get upgrade command on a Linux operating system. What is the purpose of this command?" : "Every application installed will update itself to the latest version.",
    "What is the process of dividing a large data stream into smaller pieces prior to transmission?" : "segmentation",
    "What is the PDU associated with the transport layer?" : "segment",
    "Which protocol stack layer encapsulates data into frames?" : "data link",
    "What is the name of the process of adding protocol information to data as it moves down the protocol stack?" : "encapsulation",
    "A host is transmitting a broadcast. Which host or hosts will receive it?" : "all hosts in the same network",
    "Which statement describes a characteristic of cloud computing?" : "Applications can be accessed over the Internet by individual users or businesses using any device, anywhere in the world.",
    "A network administrator can successfully ping the server at www.cisco.com, but cannot ping the company web server located at an ISP in another city. Which tool or command would help identify the specific router where the packet was lost or delayed?" : "traceroute",
    "Which OSI model layer contains protocols for process-to-process communication?" : "application",
    "At which OSI layer is a destination port number added to a PDU during the encapsulation process?" : "transport layer",
    "What process involves placing one PDU inside of another PDU?" : "encapsulation",
    "Which statement accurately describes a TCP/IP encapsulation process when a PC is sending data to the network?" : "Segments are sent from the transport layer to the internet layer.",
    "A web client is receiving a response for a web page from a web server. From the perspective of the client, what is the correct order of the protocol stack that is used to decode the received transmission?" : "Ethernet, IP, TCP, HTTP",
    "How does BYOD change the way in which businesses implement networks?" : "BYOD provides flexibility in where and how users can access network resources.",
    "In computer communication, what is the purpose of message encoding?" : "to convert information to the appropriate form for transmission",
    "Which statement is true about the TCP/IP and OSI models?" : "The TCP/IP transport layer and OSI Layer 4 provide similar services and functions.​",
    "What method can be used by two computers to ensure that packets are not dropped because too much data is being sent too quickly?" : "flow control",
    "Which Ethernet frame field assists a host in determining if the frame that is received is addressed to it?" : "destination address",
    "Which Ethernet frame field notifies destinations to get ready for a new frame?" : "preamble",
    "Which Ethernet frame field describes the higher-layer protocol that is encapsulated?" : "Type/Length",
    "Which part of the Ethernet frame helps a destination detect if there are errors in a frame?" : "frame check sequence",
    "Which OSI layer sends segments to be encapsulated in an IPv4 or IPv6 packet?" : "transport layer",
    "Which layer is responsible for taking an IP packet and preparing it for transmission over the communications medium?" : "data link layer",
    "What is the term for splitting up an IP packet when forwarding it from one medium to another medium with a smaller MTU?" : "fragmentation",
    "Which delivery method does not guarantee that the packet will be delivered fully without errors?" : "best effort",
    "What are the two most commonly referenced fields in an IPv4 packet header that indicate where the packet is coming from and where it is going? (Choose two.)" : "destination IP address ; source IP address",
    "Which statement is correct about IPv4 packet header fields?" : "The source and destination IPv4 addresses remain the same while travelling from source to destination.",
    "Which field is used to detect corruption in the IPv4 header?" : "Header Checksum",
    "Which field includes common values such as ICMP (1), TCP (6), and UDP (17)?" : "Protocol",
    "Which two statements are correct about an IPv4 address? (Choose two.)" : "It contains a network portion. ; It contains a host portion.",
    "Which two statements are correct about an IPv4 subnet mask? (Choose two.)" : "It differentiates the network portion from the host portion of an IPv4 address. ; The 1 bits determine the network portion of an IPv4 address, and the 0 bits determine the host portion.",
    "Which three statements are correct about the AND operation? (Choose three.)" : "The AND operation is performed between an IPv4 address and subnet mask. ; 1 AND 0 results in a 0 ; It is used to determine the network and host portions of an IPv4 address",
    "What is the result of a logical AND operation of: 10.128.17.4 255.255.240.0?" : "The IPv4 network address of 10.128.16.0 255.255.240.0",
    "Which statement about host forwarding decisions is true?" : "Local hosts can reach each other without the need of a router.",
    "Which default gateway statement is true?" : "The default gateway address is the IP address of the router on the local network.",
    "Which two commands could be entered on a Windows host to view its IPv4 and IPv6 routing table? (Choose two.)" : "netstat -r ; route print",
    "Which two characteristics describe Ethernet technology? (Choose two.)" : "It uses the CSMA/CD access control method. ; It is supported by IEEE 802.3 standards.",
    "What are two services provided by the OSI network layer? (Choose two.)" : "routing packets toward the destination ; encapsulating PDUs from the transport layer",
    "How do hosts ensure that their packets are directed to the correct network destination?" : "They have to keep their own local routing table that contains a route to the ; loopback interface, a local network route, and a remote default route.​",
    "A technician uses the ping 127.0.0.1 command. What is the technician testing?" : "the TCP/IP stack on a network host",
    "What is the correct compressed format of the IPv6 address 2001:0db8:eeff:000a:0000:0000:0000:0001?" : "2001:db8:eeff:a::1",
    "Which function or operation is performed by the LLC sublayer?" : "It communicates with upper protocol layers.",
    "How many usable IP addresses are available on the 192.168.1.0/27 network?" : "30",
    "Refer to the exhibit. Consider the IP address configuration shown from PC1. What is a description of the default gateway address?" : "It is the IP address of the Router1 interface that connects the PC1 LAN to Router1.",
    "What is the command netstat -r used for?" : "to display the host routing table",
    "A device has an IPv6 address of 2001:0DB8:75a3:0214:0607:1234:aa10:ba01 /64. What is the host identifier of the device?" : "0607:1234:aa10:ba01",
    "Which statement describes a MAC address?" : "It is a physical address assigned to an Ethernet NIC by the manufacturer.",
    "Why does a Layer 3 device perform the ANDing process on a destination IP address and subnet mask?" : "to identify the network address of the destination network",
    "What are two characteristics of IP? (Choose two.)" : "does not require a dedicated end-to-end connection ; operates independently of the network media",
    "Which three IP addresses are private ? (Choose three.)" : "172.16.4.4 ; 192.168.5.5 ; 10.1.1.1",
    "What is indicated by a successful ping to the ::1 IPv6 address?" : "IP is properly installed on the host.",
    "A user complains that the workstation cannot access the network. The network technician asks the user to issue the ping 127.0.0.1 command. What is the purpose of using this command?" : "to verify that the TCP/IP stack is operational",
    "What process is used in ICMPv6 for a host to verify that an IPv6 address is unique before configuring it on an interface?" : "DAD",
    "A user executes a traceroute over IPv6. At what point would a router in the path to the destination device drop the packet?" : "when the value of the Hop Limit field reaches zero",
    "Which ICMPv6 message is sent when the IPv6 hop limit field of a packet is decremented to zero and the packet cannot be forwarded?" : "time exceeded",
    "What message is sent by a host to check the uniqueness of an IPv6 address before using that address?" : "neighbor solicitation",
    "Which protocol is used by ping to test connectivity between network hosts?" : "ICMP",
    "A user issues a ping 2001:db8:3040:114::88 command and receives a response that includes a code of 3. What does this code represent?" : "port unreachable",
    "A user issues a ping 192.168.219.8 command and receives a response that includes a code of 0. What does this code represent?" : "network unreachable",
    "What characterizes a traceroute utility?" : "It identifies the routers in the path from a source host to a destination host.",
    "Why would a manager need to use the tracert command?" : "to display a list of the near-side router interfaces between the source device and the destination device",
    "Which protocol supports Stateless Address Autoconfiguration (SLAAC) for dynamic assignment of IPv6 addresses to a host?" : "ICMPv6",
    "Which statement is true about the TCP/IP and OSI models?​" : "The TCP/IP transport layer and OSI Layer 4 provide similar services and functions.​",
    "What field is used by the destination host to reassemble segments into the original order?" : "Sequence Number",
    "What field is used to provide flow control?" : "Window Size",
    "What happens when a sending host senses there is congestion?" : "The sending host reduces the number of bytes it sends before receiving an acknowledgment from the destination host.",
    "What are two roles of the transport layer in data communication on a network? (Choose two.)" : "tracking the individual communication between applications on the source and destination hosts ; identifying the proper application for each communication stream",
    "During a TCP session, a destination device sends an acknowledgment number to the source device. What does the acknowledgment number represent?" : "the next byte that the destination expects to receive",
    "Which two services or protocols use the preferred UDP protocol for fast transmission and low overhead? (Choose two)" : "Which two services or protocols use the preferred UDP protocol for fast transmission and low overhead? (Choose two) ; VoIP",
    "Which transport layer feature is used to guarantee session establishment?" : "TCP 3-way handshake",
    "Data is being sent from a source PC to a destination server. Which three statements correctly describe the function of TCP or UDP in this situation? (Choose three.)" : "The source port field identifies the running application or service that will handle data returning to the PC. ; UDP segments are encapsulated within IP packets for transport across the network. ; The UDP destination port number identifies the application or service on the server which will handle the data.",
    "What is the purpose of the TCP sliding window?" : "to request that a source decrease the rate at which it transmits data",
    "What happens if part of an FTP message is not delivered to the destination?" : "The part of the FTP message that was lost is re-sent.",
    "Which two flags in the TCP header are used in a TCP three-way handshake to establish connectivity between two network devices? (Choose two.)" : "SYN ; ACK",
    "Which two fields are included in the TCP header but not in the UDP header? (Choose two.)" : "sequence number ; window",
    "Refer to the exhibit. Which three lines represent the TCP three-way handshake?" : "lines 2, 3, and 4",
    "What is a characteristic of a TCP server process?" : "There can be many ports open simultaneously on a server, one for each active server application.",
    "What information does DHCPv4 provide to network clients? (Choose three.)" : "host address ; subnet mask ; default gateway address",
    "True or false. DHCP can lease addresses to hosts for different periods of time." : "True",
    "In large networks, static IPv4 addresses are usually assigned to which devices? (Choose two.)" : "gateway routers ; printers",
    "Which DHCP message is sent from a client when the client starts up and requires an IP address?" : "DHCPDISCOVER",
    "When client sends a DHCPDISCOVER message, how is the message sent?" : "It is broadcast on the local network.",
    "Which message does an IPv4 host use to reply when it receives a DHCPOFFER message from a DHCP server?" : "DHCPREQUEST",
    "On a home network, which device is most likely to provide dynamic IP addressing to clients on the home network?" : "a home router",
    "Which protocol automates assignment of IP addresses on a network, and which port number does it use? (Choose two.)" : "67 ; DHCP",
    "A particular website does not appear to be responding on a Windows 7 computer. What command could the technician use to show any cached DNS entries for this web page?" : "ipconfig /displaydns",
    "at type of server would use IMAP?" : "email",
    "What is a benefit of using DDNS?" : "The DDNS provider detects a change to the client IP address and immediately updates the mapping change.",
    "What application layer protocol describes the services that are used for file sharing in Microsoft networks?" : "SMB",
    "Which application layer protocol uses message types such as GET, PUT, and POST?" : "HTTP",
    "Which protocol enables mail to be downloaded from an email server to a client and then deletes the email from the server?" : "POP3",
    "Which website is considered secure because it encrypts the communication between the website and visitors?" : "https://w​ww.ourblogs.info/",
    "Refer to the exhibit. NAT is configured on Remote and Main. The PC is sending a request to the web server. What IPv4 address is the source IP address in the packet between Main and the web server?" : "203.0.113.5",
    "Which statement best describes the operation of the File Transfer Protocol?" : "An FTP server uses a source port number of 21 and a randomly generated destination port number during the establishment of control traffic with an FTP client.",
    "In NAT translation for internal hosts, what address would be used by external users to reach internal hosts?" : "inside global",
    "What is an example of a top-level domain?" : ".com",
    "Which organization is an international nonprofit organization that offers the CISSP certification?" : "(ISC)2",
    "What is a benefit to an organization of using SOAR as part of the SIEM system?" : "SOAR automates incident investigation and responds to workflows based on playbooks.",
    "Which personnel in a SOC are assigned the task of hunting for potential threats and implementing threat detection tools?" : "Tier 3 SME",
    "Which three technologies should be included in a SOC security information and event management system? (Choose three.)" : "security monitoring ; threat intelligence ; log management",
    "The term cyber operations analyst refers to which group of personnel in a SOC?" : "Tier 1 personnel",
    "How does a security information and event management system (SIEM) in a SOC help the personnel fight against security threats?" : "by combining data from multiple technologies",
    "An SOC is searching for a professional to fill a job opening. The employee must have expert-level skills in networking, endpoint, threat intelligence, and malware reverse engineering in order to search for cyber threats hidden within the network. Which job within an SOC requires a professional with those skills?" : "Threat Hunter",
    "Which three are major categories of elements in a security operations center? (Choose three.)" : "technologies ; processes ; people",
    "Which KPI metric does SOAR use to measure the time required to stop the spread of malware in the network?" : "Time to Control",
    "What job would require verification that an alert represents a true security incident or a false positive?" : "Alert Analyst",
    "When a user turns on the PC on Wednesday, the PC displays a message indicating that all of the user files have been locked. In order to get the files unencrypted, the user is supposed to send an email and include a specific ID in the email title. The message also includes ways to buy and submit bitcoins as payment for the file decryption. After inspecting the message, the technician suspects a security breach occurred. What type of malware could be responsible?" : "ransomware",
    "An employee connects wirelessly to the company network using a cell phone. The employee then configures the cell phone to act as a wireless access point that will allow new employees to connect to the company network. Which type of security threat best describes this situation?" : "rogue access point",
    "What are two examples of personally identifiable information (PII)? (Choose two.)" : "street address ; credit card number",
    "What is the dark web?" : "It is part of the internet that can only be accessed with special software.",
    "A company has just had a cybersecurity incident. The threat actor appeared to have a goal of network disruption and appeared to use a common security hack tool that overwhelmed a particular server with a large amount of traffic. This traffic rendered the server inoperable. How would a certified cybersecurity analyst classify this type of threat actor?" : "amateur",
    "A user calls the help desk complaining that the password to access the wireless network has changed without warning. The user is allowed to change the password, but an hour later, the same thing occurs. What might be happening in this situation?" : "rogue access point",
    "Which regulatory law regulates the identification, storage, and transmission of patient personal healthcare information?" : "HIPAA",
    "A worker in the records department of a hospital accidentally sends a medical record of a patient to a printer in another department. When the worker arrives at the printer, the patient record printout is missing. What breach of confidentiality does this situation describe?" : "PHI",
    "What type of cyberwarfare weapon was Stuxnet?" : "worm",
    "Which example illustrates how malware might be concealed?" : "An email is sent to the employees of an organization with an attachment that looks like an antivirus update, but the attachment actually consists of spyware.",
    "What websites should a user avoid when connecting to a free and open wireless hotspot?" : "websites to make purchases",
    "A group of users on the same network are all complaining about their computers running slowly. After investigating, the technician determines that these computers are part of a zombie network. Which type of malware is used to control these computers?" : "botnet",
    "Which statement describes cyberwarfare?" : "It is Internet-based conflict that involves the penetration of information systems of other nations.",
    "Why do IoT devices pose a greater risk than other computing devices on a network?" : "Most IoT devices do not receive frequent firmware updates.",
    "What is the main purpose of cyberwarfare?" : "to gain advantage over adversaries",
    "time required to stop the incidental from causing further damage to systems or data" : "MTTC",
    "length of time that threat actors have access to a network before their access is stopped" : "Dwell Time",
    "average time to identify that valid security incidents have occurred in the network" : "MTTD",
    "average time that it takes to stop and remediate a security incident" : "MTTR",
    "In a smart home, an owner has connected many home devices to the Internet, such as the refrigerator and the coffee maker. The owner is concerned that these devices will make the wireless network vulnerable to attacks. What action could be taken to address this issue?" : "Install the latest firmware versions for the devices.",
    "Why would a network administrator choose Linux as an operating system in the Security Operations Center (SOC)?" : "The administrator has more control over the operating system.",
    "Which two methods can be used to harden a computing device? (Choose two.)" : "Enforce the password history mechanism. ; Ensure physical security.",
    "Consider the result of the ls -l command in the Linux output below. What are the file permissions assigned to the sales user for the analyst.txt file?" : "read, write, execute",
    "A Linux system boots into the GUI by default, so which application can a network administrator use in order to access the CLI environment?" : "terminal emulator",
    "What is the well-known port address number used by DNS to serve requests?" : "53",
    "Which user can override file permissions on a Linux computer?" : "root user",
    "TELNET" : "23",
    "SSH" : "22",
    "HTTPS" : "443",
    "DNS" : "53",
    "SMTP" : "25",
    "used by Debian and Ubuntu computers and stores all authentication-related events" : "/var/log/auth.log",
    "stores information related to hardware devices and their drivers" : "/var/log/dmesg",
    "contains generic computer activity logs, and is used to store informational and noncritical system messages" : "/var/log/messages",
    "used by RedHat and CentOS computers and tracks authentication-related events" : "/var/log/secure",
    "Which type of tool allows administrators to observe and understand every detail of a network transaction?" : "packet capture software",
    "Why is Kali Linux a popular choice in testing the network security of an organization?" : "It is an open source Linux security distribution containing many penetration tools.",
    "no access" : "000",
    "execute only" : "001",
    "read and write" : "110",
    "read and execute" : "101",
    "write only" : "010",
    "lists the processes that are currently running" : "ps",
    "modifies file permissions" : "chmod",
    "runs a command as another user" : "sudo",
    "Displays the name of the current working directory" : "pwd",
    "What are two advantages of the NTFS file system compared with FAT32? (Choose two.)" : "NTFS supports larger files. ; NTFS provides more security features.",
    "A PC user issues the netstat command without any options. What is displayed as the result of this command?" : "a list of all established active TCP connections",
    "Which two commands could be used to check if DNS name resolution is working properly on a Windows PC? (Choose two.)" : "nslookup cisco.com ; ping cisco.com",
    "What is the purpose of using the net accounts command in Windows?" : "to review the settings of password and logon requirements for users",
    "The Windows boot loader Winload.exe loads." : "Step one",
    "Ntoskrnl.exe and hal.dll are loads." : "Step two",
    "Winload.exe reads the Registry, choose a hardware profile, and loads the device drivers." : "Step three",
    "Ntoskrnl.exe takes over the process." : "Step four",
    "Winlogon.exe is loaded and executes th logon process." : "Step five",
    "A technician has installed a third party utility that is used to manage a Windows 7 computer. However, the utility does not automatically start whenever the computer is started. What can the technician do to resolve this problem?" : "Change the startup type for the utility to Automatic in Services .",
    "Which statement describes the function of the Server Message Block (SMB) protocol?" : "It is used to share network resources.",
    "A user creates a file with .ps1 extension in Windows. What type of file is it?" : "PowerShell script",
    "lists files in a directory" : "dir",
    "changes the current directory" : "cd",
    "creates a new directory" : "mkdir",
    "renames a file" : "ren",
    "A user logs in to Windows with a regular user account and attempts to use an application that requires administrative privileges. What can the user do to successfully use the application?" : "Right-click the application and choose Run as Administrator .",
    "An IT technician wants to create a rule on two Windows 10 computers to prevent an installed application from accessing the public Internet. Which tool would the technician use to accomplish this task?" : "Windows Defender Firewall with Advanced Security",
    "What technology was created to replace the BIOS program on modern personal computer motherboards?" : "UEFI",
    "a background process that runs without the need for user interaction" : "daemon",
    "a program that interprets and executes user commands" : "shell",
    "a text based interface that accepts user commands" : "CLI",
    "What is the outcome when a Linux administrator enters the man man command?" : "The man man command provides documentation about the man command",
    "symlink" : "a type of file that is a reference to another file or directory",
    "daemon" : "a running background process that does not need user interaction",
    "hardening" : "protecting remote access",
    "What are two benefits of using an ext4 partition instead of ext3? (Choose two.)" : "improved performance ; increase in the size of supported files",
    "What is the purpose of entering the netsh command on a Windows PC?" : "to configure networking parameters for the PC",
    "Which type of Windows PowerShell command performs an action and returns an output or object to the next command that will be executed?" : "cmdlets",
    "maintains system logs" : "Event Viewer",
    "a CLI environment used to run scripts and automate tasks" : "PowerShell",
    "selectively denies traffic on specified interfaces" : "Windows Firewall",
    "a hierarchical database of all system and user information" : "Registry",
    "In the Linux shell, which character is used between two commands to instruct the shell to combine and execute these two commands in sequence?" : "|",
    "Why is Linux considered to be better protected against malware than other operating systems?" : "file system structure, file permissions, and user account restrictions",
    "Which Windows tool can be used by a cybersecurity administrator to secure stand-alone computers that are not part of an active directory domain?" : "Local Security Policy",
    "When a wireless network in a small office is being set up, which type of IP addressing is typically used on the networked devices?" : "private",
    "Which two parts are components of an IPv4 address? (Choose two.)" : "host portion ; network portion",
    "host address:" : "192.168.100.161/25 ; 203.0.113.100/24",
    "network address:" : "10.10.10.128/25 ; 172.110.12.64/28",
    "broadcast address:" : "192.168.1.191/26 ; 10.0.0.159/27",
    "What is the full decompressed form of the IPv6 address 2001:420:59:0:1::a/64?" : "2001:0420:0059:0000:0001:0000:0000:000a",
    "A cybersecurity analyst believes an attacker is spoofing the MAC address of the default gateway to perform a man-in-the-middle attack. Which command should the analyst use to view the MAC address a host is using to reach the default gateway?" : "arp -a",
    "A user sends an HTTP request to a web server on a remote network. During encapsulation for this request, what information is added to the address field of a frame to indicate the destination?" : "the MAC address of the default gateway",
    "What addresses are mapped by ARP?" : "destination MAC address to a destination IPv4 address",
    "What type of information is contained in an ARP table?" : "IP address to MAC address mappings",
    "TCP:" : "3-wayhandshake ; window size",
    "UDP:" : "connectionless ; best for VoIP",
    "Both UDP and TCP:" : "Port number ; checksum",
    "What type of information is contained in a DNS MX record?" : "the domain name mapped to mail exchange servers",
    "TCP" : "FTP ; HTTP ; SMTP",
    "UDP" : "TFTP ; DHCP",
    "A PC is downloading a large file from a server. The TCP window is 1000 bytes. The server is sending the file using 100-byte segments. How many segments will the server send before it requires an acknowledgment from the PC?" : "10 segments",
    "A user issues a ping 192.168.250.103 command and receives a response that includes a code of 1 . What does this code represent?" : "host unreachable",
    "Which two commands can be used on a Windows host to display the routing table? (Choose two.)" : "netstat -r ; route print",
    "A user issues a ping 2001:db8:FACE:39::10 command and receives a response that includes a code of 2 . What does this code represent?" : "protocol unreachable",
    "What message informs IPv6 enabled interfaces to use stateful DHCPv6 for obtaining an IPv6 address?" : "the ICMPv6 Router Advertisement",
    "What is the purpose of ICMP messages?" : "to provide feedback of IP packet transmissions",
    "server error" : "5xx",
    "informational" : "1xx",
    "success" : "2xx",
    "redirection" : "3xx",
    "client error" : "4xx",
    "What network service uses the WHOIS protocol?" : "DNS",
    "What action does a DHCPv4 client take if it receives more than one DHCPOFFER from multiple DHCP servers?" : "It sends a DHCPREQUEST that identifies which lease offer the client is accepting.",
    "Refer to the exhibit. From the perspective of users behind the NAT router, what type of NAT address is 209.165.201.1?" : "inside global",
    "POP:" : "does not require a centralized backup solution. ; mail is deleted as it is downloaded. ; desirable for an ISP or large business.",
    "IMAP:" : "download copies of messages to be the client. ; original messages must be manually deleted. ; requires a larger a mount of disk space.",
    "What is done to an IP packet before it is transmitted over the physical medium?" : "It is encapsulated in a Layer 2 frame.",
    "Which PDU is processed when a host computer is de-encapsulating a message at the transport layer of the TCP/IP model?" : "segment",
    "Which networking model is being used when an author uploads one chapter document to a file server of a book publisher?" : "client/server",
    "Which type of transmission is used to transmit a single video stream such as a web-based video conference to a select number of users?" : "multicast",
    "Refer to the exhibit. PC1 attempts to connect to File_server1 and sends an ARP request to obtain a destination MAC address. Which MAC address will PC1 receive in the ARP reply?" : "the MAC address of the G0/0 interface on R1",
    "What is the result of an ARP poisoning attack?" : "Client information is stolen.",
    "What is the function of the HTTP GET message?" : "to request an HTML page from a web server",
    "Which protocol is a client/server file sharing protocol and also a request/response protocol?" : "SMB",
    "How is a DHCPDISCOVER transmitted on a network to reach a DHCP server?" : "A DHCPDISCOVER message is sent with the broadcast IP address as the destination address.",
    "What is a description of a DNS zone transfer?" : "transferring blocks of DNS data from a DNS server to another server",
    "What are the two sizes (minimum and maximum) of an Ethernet frame? (Choose two.)" : "64 bytes ; 1518 bytes",
    "Which process failed if a computer cannot access the internet and received an IP address of 169.254.142.5?" : "DHCP",
    "Which statement describes a feature of the IP protocol?" : "IP relies on upper layer services to handle situations of missing or out-of-order packets.",
    "What is a basic characteristic of the IP protocol?" : "connectionless",
    "Which statement describes the ping and tracert commands?" : "Tracert shows each hop, while ping shows a destination reply only.",
    "A large corporation has modified its network to allow users to access network resources from their personal laptops and smart phones. Which networking trend does this describe?" : "bring your own device",
    "the process of placing one message format inside another message format" : "message encapsulation",
    "the process of breaking up a long message into individual pieces before being sent over the network" : "message sizing",
    "the process of converting information from one format into another acceptable for transmission" : "message encoding",
    "Which method would an IPv6-enabled host using SLAAC employ to learn the address of the default gateway?" : "router advertisement messages received from the link router",
    "Refer to the exhibit. This PC is unable to communicate with the host at 172.16.0.100. What information can be gathered from the displayed output?" : "The communication fails after the default gateway.",
    "A user issues a ping 192.168.250.103 command and receives a response that includes a code of 1. What does this code represent?" : "host unreachable",
    "What are three responsibilities of the transport layer? (Choose three.)" : "identifying the applications and services on the client and server that should handle transmitted data ; meeting the reliability requirements of applications, if any ; multiplexing multiple communication streams from many users or applications on the same network",
    "How does network scanning help assess operations security?" : "It can detect open TCP ports on network systems.",
    "Refer to the exhibit. A network security analyst is examining captured data using Wireshark. The captured frames indicate that a host is downloading malware from a server. Which source port is used by the host to request the download?" : "48598",
    "Which two operations are provided by TCP but not by UDP? (Choose two.)" : "retransmitting any unacknowledged data ; acknowledging received data",
    "A user is executing a tracert to a remote device. At what point would a router, which is in the path to the destination device, stop forwarding the packet?" : "when the value in the TTL field reaches zero",
    "A network administrator is testing network connectivity by issuing the ping command on a router. Which symbol will be displayed to indicate that a time expired during the wait for an ICMP echo reply message?" : ".",
    "A technician is configuring email on a mobile device. The user wants to be able to keep the original email on the server, organize it into folders, and synchronize the folders between the mobile device and the server. Which email protocol should the technician use?" : "IMAP",
    "At which OSI layer is a source MAC address added to a PDU during the encapsulation process?" : "data link layer",
    "Which value, that is contained in an IPv4 header field, is decremented by each router that receives a packet?" : "Time-to-Live",
    "Which two ICMP messages are used by both IPv4 and IPv6 protocols? (Choose two.)​" : "route redirection ; protocol unreachable",
    "What mechanism is used by a router to prevent a received IPv4 packet from traveling endlessly on a network?" : "It decrements the value of the TTL field by 1 and if the result is 0, it discards the packet and sends a Time Exceeded message to the source host.",
    "A device has been assigned the IPv6 address of 2001:0db8:cafe:4500:1000:00d8:0058:00ab/64. Which is the host identifier of the device?" : "1000:00d8:0058:00ab",
    "What three application layer protocols are part of the TCP/IP protocol suite? (Choose three.)" : "DHCP ; FTP ; DNS",
    "A computer can access devices on the same network but cannot access devices on other networks. What is the probable cause of this problem?" : "The computer has an invalid default gateway address.",
    "Refer to the exhibit. PC1 issues an ARP request because it needs to send a packet to PC3. In this scenario, what will happen next?" : "RT1 will send an ARP reply with its own Fa0/0 MAC address.",
    "A user who is unable to connect to the file server contacts the help desk. The helpdesk technician asks the user to ping the IP address of the default gateway that is configured on the workstation. What is the purpose for this ping command?" : "to test that the host has the capability to reach hosts on other networks",
    "A user gets an IP address of 192.168.0.1 from the company network administrator. A friend of the user at a different company gets the same IP address on another PC. How can two PCs use the same IP address and still reach the Internet, send and receive email, and search the web?" : "ISPs use Network Address Translation to change a user IP address into an address that can be used on the Internet.",
    "How many host addresses are available on the 192.168.10.128/26 network?" : "62",
    "What are the three ranges of IP addresses that are reserved for internal private use? (Choose three.)" : "192.168.0.0/16 ; 172.16.0.0/12 ; 10.0.0.0/8",
    "Refer to the exhibit. A cybersecurity analyst is viewing captured packets forwarded on switch S1. Which device has the MAC address 50:6a:03:96:71:22?" : "router DG",
    "A host PC is attempting to lease an address through DHCP. What message is sent by the server to let the client know it is able to use the provided IP information?" : "DHCPACK",
    "An employee complains that a Windows PC cannot connect to the Internet. A network technician issues the ipconfig command on the PC and is shown an IP address of 169.254.10.3. Which two conclusions can be drawn? (Choose two.)" : "The PC is configured to obtain an IP address automatically. ; The PC cannot contact a DHCP server.",
    "What is a function of the tracert command that differs from the ping command when they are used on a workstation?" : "The tracert command shows the information of routers in the path.",
    "Which two functions or operations are performed by the MAC sublayer? (Choose two.)" : "It is responsible for Media Access Control. ; It adds a header and trailer to form an OSI Layer 2 PDU.",
    "Which field in an IPv4 packet header will typically stay the same during its transmission?" : "Destination Address",
    "first connection established" : "from client to server via TCP port 21 ; used for commands and replies",
    "second connection established" : "from client to server via TCP port 20 ; used for actual file transfer",
    "Which two statements are characteristics of a virus? (Choose two.)" : "A virus typically requires end-user activation. ; A virus can be dormant and then activate at a specific time or date.",
    "What is a characteristic of a Trojan horse as it relates to network security?" : "Malware is contained in a seemingly legitimate executable program.",
    "What technique is used in social engineering attacks?" : "phishing",
    "What is a purpose of implementing VLANs on a network?" : "They can separate user traffic.",
    "Refer to the exhibit. A cybersecurity analyst is viewing packets forwarded by switch S2. What addresses will identify frames containing data sent from PCA to PCB?" : "Src IP: 192.168.1.212 Src ; MAC: 00-60-0F-B1-33-33= ; Dst IP: 192.168.2.101;  Dst MAC: 08-CB-8A-5C-BB-BB",
    " A cybersecurity analyst needs to collect alert data. What are three detection tools to perform this task in the Security Onion architecture? (Choose three.)" : "CapME; Wazuh; Zeek",
    "In network security assessments, which type of test is used to evaluate the risk posed by vulnerabilities to a specific organization including assessment of the likelihood of attacks and the impact of successful exploits on the organization?" : "risk analysis",
    "In addressing an identified risk, which strategy aims to shift some of the risk to other parties?" : "risk sharing",
    "What is a network tap?" : "a passive device that forwards all traffic and physical layer errors to an analysis device",
    "" : "",
    "" : ""
}
